apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g47xxx_hrtim.h
#define HRTIM_CMNCR_CKPSC_SHIFT      0         /* Bits 0-2: Clock prescaler */
#define HRTIM_CMNCR_CKPSC_MASK       (7 << HRTIM_CMNCR_CKPSC_SHIFT)
#  define HRTIM_CMNCR_CKPSC_NODIV    (0 << HRTIM_CMNCR_CKPSC_SHIFT)
#  define HRTIM_CMNCR_CKPSC_d2       (1 << HRTIM_CMNCR_CKPSC_SHIFT)
#  define HRTIM_CMNCR_CKPSC_d4       (2 << HRTIM_CMNCR_CKPSC_SHIFT)
#  define HRTIM_CMNCR_CKPSC_d8       (3 << HRTIM_CMNCR_CKPSC_SHIFT)
#  define HRTIM_CMNCR_CKPSC_d16      (4 << HRTIM_CMNCR_CKPSC_SHIFT)
#  define HRTIM_CMNCR_CKPSC_d32      (5 << HRTIM_CMNCR_CKPSC_SHIFT)
#  define HRTIM_CMNCR_CKPSC_d64      (6 << HRTIM_CMNCR_CKPSC_SHIFT)
#  define HRTIM_CMNCR_CKPSC_d128     (7 << HRTIM_CMNCR_CKPSC_SHIFT)
#define HRTIM_CMNCR_CONT             (1 << 3)  /* Bit 3: Continuous mode */
#define HRTIM_CMNCR_RETRIG           (1 << 4)  /* Bit 4: Re-triggerable mode */
#define HRTIM_CMNCR_HALF             (1 << 5)  /* Bit 5: Half mode */
                                               /* Bits 6-9 differs */
#define HRTIM_CMNCR_SYNCRST          (1 << 10) /* Bit 10: Synchronization Resets Master */
#define HRTIM_CMNCR_SYNCSTRTM        (1 << 11) /* Bit 11: Synchronization Starts Master */
                                               /* Bits 12-24 differs */
#define HRTIM_CMNCR_DACSYNC_SHIFT    25        /* Bits 25-26: DAC Synchronization*/
#define HRTIM_CMNCR_DACSYNC_MASK     (3 << HRTIM_CMNCR_DACSYNC_SHIFT)
#  define HRTIM_CMNCR_DACSYNC_00     (0 << HRTIM_CMNCR_DACSYNC_SHIFT) /* 00: No DAC trigger generated */
#  define HRTIM_CMNCR_DACSYNC_01     (1 << HRTIM_CMNCR_DACSYNC_SHIFT) /* 01: Trigger generated on hrtim_dac_trg1 */
#  define HRTIM_CMNCR_DACSYNC_10     (2 << HRTIM_CMNCR_DACSYNC_SHIFT) /* 10: Trigger generated on hrtim_dac_trg2 */
#  define HRTIM_CMNCR_DACSYNC_11     (3 << HRTIM_CMNCR_DACSYNC_SHIFT) /* 11: Trigger generated on hrtim_dac_trg3 */
#define HRTIM_CMNCR_PREEN            (1 << 27)                        /* Bit 27: Preload enable */
                                                                      /* Bits 28-31 differs */

/* Control Register Bits specific to Master Timer */

#define HRTIM_MCR_INTLVD_SHIFT     6                             /* Bits 6-7: Interleaved mode */
#define HRTIM_MCR_INTLVD_MASK      (4 << HRTIM_MCR_INTLVD_SHIFT)
#  define HRTIM_MCR_INTLVD_DIS     (0 << HRTIM_MCR_INTLVD_SHIFT) /* 00: Interleaved mode disabled */
#  define HRTIM_MCR_INTLVD_TRIPLE  (1 << HRTIM_MCR_INTLVD_SHIFT) /* 01: Triple interleaved mode */
#  define HRTIM_MCR_INTLVD_QUAD    (2 << HRTIM_MCR_INTLVD_SHIFT) /* 10: Quad interleaved mode*/
                                                                 /* 11: Interleaved mode disabled */
#define HRTIM_MCR_SYNCIN_SHIFT     8                             /* Bits 8-9: Synchronization input */
#define HRTIM_MCR_SYNCIN_MASK      (3 << HRTIM_MCR_SYNCIN_SHIFT)
#  define HRTIM_MCR_SYNCIN_DIS     (0 << HRTIM_MCR_SYNCIN_SHIFT) /* 00: Disabled */
#  define HRTIM_MCR_SYNCIN_INTE    (2 << HRTIM_MCR_SYNCIN_SHIFT) /* 10: Internal Event */
#  define HRTIM_MCR_SYNCIN_EXTE    (3 << HRTIM_MCR_SYNCIN_SHIFT) /* 11: External Event */
#define HRTIM_MCR_SYNCOUT_SHIFT    12                            /* Bits 12-13: Synchronization output */
#define HRTIM_MCR_SYNCOUT_MASK     (3 << HRTIM_MCR_SYNCOUT_SHIFT)
#  define HRTIM_MCR_SYNCOUT_DIS    (0 << HRTIM_MCR_SYNCOUT_SHIFT) /* 00: Disabled */
#  define HRTIM_MCR_SYNCOUT_POS    (2 << HRTIM_MCR_SYNCOUT_SHIFT) /* 10: Positive pulse on SCOUT */
#  define HRTIM_MCR_SYNCOUT_NEG    (3 << HRTIM_MCR_SYNCOUT_SHIFT) /* 11: Negative pulse on SCOUT */
#define HRTIM_MCR_SYNCSRC_SHIFT    14                             /* Bits 14-15: Synchronization source*/
#define HRTIM_MCR_SYNCSRC_MASK     (3 << HRTIM_MCR_SYNCSRC_SHIFT)
#  define HRTIM_MCR_SYNCSRC_MSTRT  (0 << HRTIM_MCR_SYNCSRC_SHIFT) /* 00: Master timer Start */
#  define HRTIM_MCR_SYNCSRC_MCMP1  (1 << HRTIM_MCR_SYNCSRC_SHIFT) /* 01: Master timer Compare 1 Event */
#  define HRTIM_MCR_SYNCSRC_TASTRT (2 << HRTIM_MCR_SYNCSRC_SHIFT) /* 10: Timer A start/reset */
#  define HRTIM_MCR_SYNCSRC_TACMP1 (3 << HRTIM_MCR_SYNCSRC_SHIFT) /* 11: Timer A Compare 1 Event */
#define HRTIM_MCR_TCEN_SHIFT       (16)
#define HRTIM_MCR_MCEN             (1 << 16) /* Bit 16: Master timer counter enable */
#define HRTIM_MCR_TACEN            (1 << 17) /* Bit 17: Timer A counter enable */
#define HRTIM_MCR_TBCEN            (1 << 18) /* Bit 18: Timer B counter enable */
#define HRTIM_MCR_TCCEN            (1 << 19) /* Bit 19: Timer C counter enable */
#define HRTIM_MCR_TDCEN            (1 << 20) /* Bit 20: Timer D counter enable */
#define HRTIM_MCR_TECEN            (1 << 21) /* Bit 21: Timer E counter enable */
#define HRTIM_MCR_TFCEN            (1 << 22) /* Bit 22: Timer F counter enable */
                                             /* Bits 23-24: Reserved */
                                             /* Bit 28: Reserved */
#define HRTIM_MCR_MREPU            (1 << 29) /* Bit 29: Master Timer Repetition Update */
#define HRTIM_MCR_BRSTDMA_SHIFT    30        /* Bits 30-31: Burs DMA Update*/
#define HRTIM_MCR_BRSTDMA_MASK     (3 << HRTIM_MCR_BRSTDMA_SHIFT)
#  define HRTIM_MCR_BRSTDMA_00     (0 << HRTIM_MCR_BRSTDMA_SHIFT) /* 00 */
#  define HRTIM_MCR_BRSTDMA_01     (1 << HRTIM_MCR_BRSTDMA_SHIFT) /* 01 */
#  define HRTIM_MCR_BRSTDMA_10     (2 << HRTIM_MCR_BRSTDMA_SHIFT) /* 10 */

/* Master Timer Interrupt Status Register */

#define HRTIM_MISR_MCMP1           (1 << 0) /* Bit 0: Master Compare 1 Interrupt Flag */
#define HRTIM_MISR_MCMP2           (1 << 1) /* Bit 1: Master Compare 2 Interrupt Flag */
#define HRTIM_MISR_MCMP3           (1 << 2) /* Bit 2: Master Compare 3 Interrupt Flag */
#define HRTIM_MISR_MCMP4           (1 << 3) /* Bit 3: Master Compare 4 Interrupt Flag */
#define HRTIM_MISR_MREP            (1 << 4) /* Bit 4: Master Repetition Interrupt Flag */
#define HRTIM_MISR_SYNC            (1 << 5) /* Bit 5: Sync Input Interrupt Flag */
#define HRTIM_MISR_MUPD            (1 << 6) /* Bit 6: Master Update Interrupt Flag */

/* Master Timer Interrupt Clear Register */

#define HRTIM_MICR_MCMP1C          (1 << 0) /* Bit 0: Master Compare 1 Interrupt Flag Clear */
#define HRTIM_MICR_MCMP2C          (1 << 1) /* Bit 1: Master Compare 2 Interrupt Flag Clear  */
#define HRTIM_MICR_MCMP3C          (1 << 2) /* Bit 2: Master Compare 3 Interrupt Flag Clear  */
#define HRTIM_MICR_MCMP4C          (1 << 3) /* Bit 3: Master Compare 4 Interrupt Flag Clear  */
#define HRTIM_MICR_MREPC           (1 << 4) /* Bit 4: Master Repetition Interrupt Flag Clear  */
#define HRTIM_MICR_SYNCC           (1 << 5) /* Bit 5: Sync Input Interrupt Flag Clear  */
#define HRTIM_MICR_MUPDC           (1 << 6) /* Bit 6: Master Update Interrupt Flag Clear  */

/* Master Timer DMA/Interrupt Clear Register */

#define HRTIM_MDIER_MCMP1IE        (1 << 0)  /* Bit 0: Master Compare 1 Interrupt Enable */
#define HRTIM_MDIER_MCMP2IE        (1 << 1)  /* Bit 1: Master Compare 2 Interrupt Enable */
#define HRTIM_MDIER_MCMP3IE        (1 << 2)  /* Bit 2: Master Compare 3 Interrupt Enable */
#define HRTIM_MDIER_MCMP4IE        (1 << 3)  /* Bit 3: Master Compare 4 Interrupt Enable */
#define HRTIM_MDIER_MREPIE         (1 << 4)  /* Bit 4: Master Repetition Interrupt Enable */
#define HRTIM_MDIER_SYNCIE         (1 << 5)  /* Bit 5: Sync Input Interrupt Enable */
#define HRTIM_MDIER_MUPDIE         (1 << 6)  /* Bit 6: Master Update Interrupt Enable */
#define HRTIM_MDIER_MCMP1DE        (1 << 16) /* Bit 16: Master compare 1 DMA request enable */
#define HRTIM_MDIER_MCMP2DE        (1 << 17) /* Bit 17:  Master compare 2 DMA request enable */
#define HRTIM_MDIER_MCMP3DE        (1 << 18) /* Bit 18: Master compare 3 DMA request enable */
#define HRTIM_MDIER_MCMP4DE        (1 << 19) /* Bit 19: Master compare 4 DMA request enable */
#define HRTIM_MDIER_MREPDE         (1 << 20) /* Bit 20: Master repetition DMA request enable */
#define HRTIM_MDIER_SYNCDE         (1 << 21) /* Bit 21: Sync input DMA request enable */
#define HRTIM_MDIER_MUPDDE         (1 << 22) /* Bit 22: Master update DMA request enable */

