apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g47xxx_hrtim.h
/* Master Timer Counter Register */

#define HRTIM_MCNTR_SHIFT          0 /* Bits 0-15: Counter Value */
#define HRTIM_MCNTR_MASK           (0xffff << HRTIM_MCNTR_SHIFT)

/* Master Timer Period Register */

#define HRTIM_MPER_SHIFT           0 /* Bits 0-15: Master Timer Period value */
#define HRTIM_MPER_MASK            (0xffff << HRTIM_MPER_SHIFT)

/* Master Timer Repetition Register */

#define HRTIM_MREP_SHIFT           0 /* Bits 0-8: Master Timer Repetition period value */
#define HRTIM_MREP_MASK            (0xff << HRTIM_MREP_SHIFT)

/* Master Timer Compare 1 Register */

#define HRTIM_MCMP1_SHIFT           0 /* Bits 0-15: Master Timer Compare 1 value */
#define HRTIM_MCMP1_MASK            (0xffff << HRTIM_MCMP1_SHIFT)

/* Master Timer Compare 2 Register */

#define HRTIM_MCMP2_SHIFT           0 /* Bits 0-15: Master Timer Compare 2 value */
#define HRTIM_MCMP2_MASK            (0xffff << HRTIM_MCMP2_SHIFT)

/* Master Timer Compare 3 Register */

#define HRTIM_MCMP3_SHIFT           0 /* Bits 0-15: Master Timer Compare 3 value  */
#define HRTIM_MCMP3_MASK            (0xffff << HRTIM_MCMP3_SHIFT)

/* Master Timer Compare 4 Register */

#define HRTIM_MCMP4_SHIFT           0 /* Bits 0-15: Master Timer Compare 4 value  */
#define HRTIM_MCMP4_MASK            (0xffff << HRTIM_MCMP4_SHIFT)

/* Timer A-F Control Register */

#define HRTIM_TIMCR_CKPSC_SHIFT     0                                /* Bits 0-2: HRTIM timer x clock prescaler */
#define HRTIM_TIMCR_CKPSC_MASK      (7 << HRTIM_TIMCR_CKPSC_SHIFT)
#define HRTIM_TIMCR_CONT            (1 << 3)                         /* Bit 3: Continuous mode */
#define HRTIM_TIMCR_RETRIG          (1 << 4)                         /* Bit 4: Re-triggerable mode */
#define HRTIM_TIMCR_HALF            (1 << 5)                         /* Bit 5: Half mode enable */
#define HRTIM_TIMCR_PSHPLL          (1 << 6)                         /* Bit 6: Push-Pull mode enable */
#define HRTIM_TIMCR_INTLVD_SHIFT    7                                /* Bits 7-8: Interleaved mode */
#define HRTIM_TIMCR_INTLVD_MASK     (3 << HRTIM_TIMCR_INTLVD_SHIFT)
#  define HRTIM_TIMCR_INTLVD_DIS    (0 << HRTIM_TIMCR_INTLVD_SHIFT)  /* 00: Interleaved mode disabled */
#  define HRTIM_TIMCR_INTLVD_TRI    (1 << HRTIM_TIMCR_INTLVD_SHIFT)  /* 01: Triple interleaved mode */
#  define HRTIM_TIMCR_INTLVD_QUAD   (2 << HRTIM_TIMCR_INTLVD_SHIFT)  /* 10: Quad interleaved mode */
                                                                     /* 11: Interleaved mode disabled */
#define HRTIM_TIMCR_RSYNCU          (1 << 9)                         /* Bit 9: Re-synchronized update */
#define HRTIM_TIMCR_SYNCRST         (1 << 10)                        /* Bit 10: Synchronization resets timer x */
#define HRTIM_TIMCR_SYNCSTRT        (1 << 11)                        /* Bit 11: Synchronization starts timer x */
#define HRTIM_TIMCR_DELCMP2_SHIFT   12                               /* Bits 12-13: CMP2 auto-delayed mode */
#define HRTIM_TIMCR_DELCMP2_MASK    (3 << HRTIM_TIMCR_DELCMP2_SHIFT)
#  define HRTIM_TIMCR_DELCMP2_00    (0 << HRTIM_TIMCR_DELCMP2_SHIFT) /* 00: CMP2 register is always active */
#  define HRTIM_TIMCR_DELCMP2_01    (1 << HRTIM_TIMCR_DELCMP2_SHIFT) /* 01: CMP2 value is recomputed and is active following a capture 1 event */
#  define HRTIM_TIMCR_DELCMP2_10    (2 << HRTIM_TIMCR_DELCMP2_SHIFT) /* 10: CMP2 value is recomputed and is active following a capture 1 event, or is recomputed and active after compare 1 match */
#  define HRTIM_TIMCR_DELCMP2_11    (3 << HRTIM_TIMCR_DELCMP2_SHIFT) /* 11: CMP2 value is recomputed and is active following a capture 1 event, or is recomputed and active after compare 3 match */
#define HRTIM_TIMCR_DELCMP4_SHIFT   12                               /* Bits 14-15: CMP4 auto-delayed mode */
#define HRTIM_TIMCR_DELCMP4_MASK    (3 << HRTIM_TIMCR_DELCMP4_SHIFT)
#  define HRTIM_TIMCR_DELCMP4_00    (0 << HRTIM_TIMCR_DELCMP4_SHIFT) /* 00: CMP4 register is always active */
#  define HRTIM_TIMCR_DELCMP4_01    (1 << HRTIM_TIMCR_DELCMP4_SHIFT) /* 01: CMP4 value is recomputed and is active following a capture 2 event */
#  define HRTIM_TIMCR_DELCMP4_10    (2 << HRTIM_TIMCR_DELCMP4_SHIFT) /* 10: CMP4 value is recomputed and is active following a capture 2 event, or is recomputed and active after Compare 1 match */
#  define HRTIM_TIMCR_DELCMP4_11    (3 << HRTIM_TIMCR_DELCMP4_SHIFT) /* 11: CMP4 value is recomputed and is active following a capture 2 event, or is recomputed and active after Compare 3 match */
#define HRTIM_TIMCR_TAU             (1 << 19)                        /* Bit 16: Timer F Update */
#define HRTIM_TIMCR_REPU            (1 << 17)                        /* Bit 17: Timer X Repetition Update */
#define HRTIM_TIMCR_RSTU            (1 << 18)                        /* Bit 18: Timer X Reset Update */
#define HRTIM_TIMCR_TAU             (1 << 19)                        /* Bit 19: Timer A Update */
#define HRTIM_TIMCR_TBU             (1 << 20)                        /* Bit 20: Timer B Update */
#define HRTIM_TIMCR_TCU             (1 << 21)                        /* Bit 21: Timer C Update */
#define HRTIM_TIMCR_TDU             (1 << 22)                        /* Bit 22: Timer D Update */
#define HRTIM_TIMCR_TEU             (1 << 23)                        /* Bit 23: Timer E Update */
#define HRTIM_TIMCR_MSTU            (1 << 24)                        /* Bit 24: Master Timer Update */
#define HRTIM_TIMCR_DACSYNC_SHIFT   25                               /* Bits 25-26: DAC synchronization */
#define HRTIM_TIMCR_DACSYNC_MASK    (1 << HRTIM_TIMCR_DACSYNC_SHIFT)
#  define HRTIM_TIMCR_DACSYNC_NOTRG                                  /* 00: No DAC trigger generated */
#  define HRTIM_TIMCR_DACSYNC_TRG1                                   /* 01: Trigger generated on hrtim_dac_trg1 */
#  define HRTIM_TIMCR_DACSYNC_TRG2                                   /* 10: Trigger generated on hrtim_dac_trg2 */
#  define HRTIM_TIMCR_DACSYNC_TRG3                                   /* 11: Trigger generated on hrtim_dac_trg3 */
#define HRTIM_TIMCR_PREEN           (1 << 27)                        /* Bit 27: Preload enable */
#define HRTIM_TIMCR_UPDGAT_SHIFT    28                               /* Bits 28-31: Update Gating */
#define HRTIM_TIMCR_UPDGAT_MASK     (15 << HRTIM_TIMCR_UPDGAT_SHIFT)
#  define HRTIM_TIMCR_UPDGAT_0000   (0 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 0000: The update occurs independently from the DMA burst transfer */
#  define HRTIM_TIMCR_UPDGAT_0001   (1 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 0001: The update occurs when the DMA burst transfer is completed */
#  define HRTIM_TIMCR_UPDGAT_0010   (2 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 0010: The update occurs on the update event following the DMA burst transfer completion */
#  define HRTIM_TIMCR_UPDGAT_0011   (3 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 0011: The update occurs on a rising edge on hrtim_upd_en1 */
#  define HRTIM_TIMCR_UPDGAT_0100   (4 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 0100: The update occurs on a rising edge on hrtim_upd_en2 */
#  define HRTIM_TIMCR_UPDGAT_0101   (5 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 0101: The update occurs on a rising edge on hrtim_upd_en3 */
#  define HRTIM_TIMCR_UPDGAT_0110   (6 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 0110: The update occurs on the update event following a rising edge on hrtim_upd_en1 */
#  define HRTIM_TIMCR_UPDGAT_0111   (7 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 0111: The update occurs on the update event following a rising edge on hrtim_upd_en2 */
#  define HRTIM_TIMCR_UPDGAT_1000   (8 << HRTIM_TIMCR_UPDGAT_SHIFT)  /* 1000: The update occurs on the update event following a rising edge on hrtim_upd_en3 */

/* Timer X Interrupt Status Register */

