apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g47xxx_hrtim.h
#define HRTIM_TIMCMP1_SHIFT         0 /* Bits 0-15: Timer X Compare 1 Value */
#define HRTIM_TIMCMP1_MASK          (0xffff << HRTIM_TIMCMP1_SHIFT)

/* Timer X Compare 1 Compound Register */

#define HRTIM_TIMCMP1C_SHIFT        0 /* Bits 0-15: Timer X Compare 1 Value */
#define HRTIM_TIMCMP1C_MASK         (0xffff << HRTIM_TIMCMP1C_SHIFT)
#define HRTIM_TIMREPC_SHIFT         0 /* Bits 0-8: Timer X Repetition Value */
#define HRTIM_TIMREPC_MASK          (0xff << HRTIM_TIMCMP1C_SHIFT)

/* Timer X Compare 2 Register */

#define HRTIM_TIMCMP2_SHIFT         0 /* Bits 0-15: Timer X Compare 2 Value */
#define HRTIM_TIMCMP2_MASK          (0xffff << HRTIM_TIMCMP2_SHIFT)

/* Timer X Compare 3 Register */

#define HRTIM_TIMCMP3_SHIFT         0 /* Bits 0-15: Timer X Compare 3 Value */
#define HRTIM_TIMCMP3_MASK          (0xffff << HRTIM_TIMCMP3_SHIFT)

/* Timer X Compare 4 Register */

#define HRTIM_TIMCMP4_SHIFT         0 /* Bits 0-15: Timer X Compare 4 Value */
#define HRTIM_TIMCMP4_MASK          (0xffff << HRTIM_TIMCMP4_SHIFT)

/* Timer X Capture 1 Register */

#define HRTIM_TIMCPT1_SHIFT         0 /* Bits 0-15: Timer X Capture 1 Value */
#define HRTIM_TIMCPT1_MASK          (0xffff << HRTIM_TIMCPT1_SHIFT)

/* Timer X Capture 2 Register */

#define HRTIM_TIMCPT2_SHIFT         0 /* Bits 0-15: Timer X Capture 2 Value */
#define HRTIM_TIMCPT2_MASK          (0xffff << HRTIM_TIMCPT2_SHIFT)

/* Timer X Deadtime Register */

#define HRTIM_TIMDT_DTR_SHIFT       0         /* Bits 0-8: Deadtime Rising Value */
#define HRTIM_TIMDT_DTR_MASK        (0xff << HRTIM_TIMDT_DTR_SHIFT)
#define HRTIM_TIMDT_SDTR            (1 << 9)  /* Bit 9: Sign Deadtime Rising Value */
#define HRTIM_TIMDT_DTPRSC_SHIFT    10        /* Bits 10-12: Deadtime Prescaler */
#define HRTIM_TIMDT_DTPRSC_MASK     (7 << HRTIM_TIMDT_DTPRSC_SHIFT)
#  define HRTIM_TIMDT_DTPRSC_000    (0 << HRTIM_TIMDT_DTPRSC_SHIFT)
#  define HRTIM_TIMDT_DTPRSC_001    (1 << HRTIM_TIMDT_DTPRSC_SHIFT)
#  define HRTIM_TIMDT_DTPRSC_010    (2 << HRTIM_TIMDT_DTPRSC_SHIFT)
#  define HRTIM_TIMDT_DTPRSC_011    (3 << HRTIM_TIMDT_DTPRSC_SHIFT)
#  define HRTIM_TIMDT_DTPRSC_100    (4 << HRTIM_TIMDT_DTPRSC_SHIFT)
#  define HRTIM_TIMDT_DTPRSC_101    (5 << HRTIM_TIMDT_DTPRSC_SHIFT)
#  define HRTIM_TIMDT_DTPRSC_110    (6 << HRTIM_TIMDT_DTPRSC_SHIFT)
#  define HRTIM_TIMDT_DTPRSC_111    (7 << HRTIM_TIMDT_DTPRSC_SHIFT)
#define HRTIM_TIMDT_DTRSLK          (1 << 14) /* Bit 14: Deadtime Rising Sign Lock */
#define HRTIM_TIMDT_DTRLK           (1 << 15) /* Bit 15: Deadtime Rising Lock */
#define HRTIM_TIMDT_DTF_SHIFT       16        /* Bits 16-24: Deadtime Falling Value */
#define HRTIM_TIMDT_DTF_MASK        (0x1ff << HRTIM_TIMDT_DTF_SHIFT)
#define HRTIM_TIMDT_SDTF            (1 << 25) /* Bit 25: Sign Deadtime Falling Value */
#define HRTIM_TIMDT_DTFSLK          (1 << 30) /* Bit 30: Deadtime Falling Sign Lock */
#define HRTIM_TIMDT_DTFLK           (1 << 31) /* Bit 31: Deadtime Falling Lock */

/* Timer X Output1 Set Register */

#define HRTIM_TIMSET1_SST           (1 << 0)  /* Bit 0: Software Set trigger */
#define HRTIM_TIMSET1_RESYNC        (1 << 1)  /* Bit 1: Timer A resynchronization */
#define HRTIM_TIMSET1_PER           (1 << 2)  /* Bit 2: Timer X Period */
#define HRTIM_TIMSET1_CMP1          (1 << 3)  /* Bit 3: Timer X Compare 1 */
#define HRTIM_TIMSET1_CMP2          (1 << 4)  /* Bit 4: Timer X Compare 2 */
#define HRTIM_TIMSET1_CMP3          (1 << 5)  /* Bit 5: Timer X Compare 3 */
#define HRTIM_TIMSET1_CMP4          (1 << 6)  /* Bit 6: Timer X Compare 4 */
#define HRTIM_TIMSET1_MSTPER        (1 << 7)  /* Bit 7: Master Period */
#define HRTIM_TIMSET1_MSTCMP1       (1 << 8)  /* Bit 8: Master Compare 1 */
#define HRTIM_TIMSET1_MSTCMP2       (1 << 9)  /* Bit 9: Master Compare 2 */
#define HRTIM_TIMSET1_MSTCMP3       (1 << 10) /* Bit 10: Master Compare 3 */
#define HRTIM_TIMSET1_MSTCMP4       (1 << 11) /* Bit 11: Master Compare 4 */
#define HRTIM_TIMSET1_TIMEVNT1      (1 << 12) /* Bit 12: Timer Event 1 */
#define HRTIM_TIMSET1_TIMEVNT2      (1 << 13) /* Bit 13: Timer Event 2 */
#define HRTIM_TIMSET1_TIMEVNT3      (1 << 14) /* Bit 14: Timer Event 3 */
#define HRTIM_TIMSET1_TIMEVNT4      (1 << 15) /* Bit 15: Timer Event 4 */
#define HRTIM_TIMSET1_TIMEVNT5      (1 << 16) /* Bit 16: Timer Event 5 */
#define HRTIM_TIMSET1_TIMEVNT6      (1 << 17) /* Bit 17: Timer Event 6 */
#define HRTIM_TIMSET1_TIMEVNT7      (1 << 18) /* Bit 18: Timer Event 7 */
#define HRTIM_TIMSET1_TIMEVNT8      (1 << 19) /* Bit 19: Timer Event 8 */
#define HRTIM_TIMSET1_TIMEVNT9      (1 << 20) /* Bit 20: Timer Event 9 */
#define HRTIM_TIMSET1_EXTEVNT1      (1 << 21) /* Bit 21: External Event 1 */
#define HRTIM_TIMSET1_EXTEVNT2      (1 << 22) /* Bit 22: External Event 2 */
#define HRTIM_TIMSET1_EXTEVNT3      (1 << 23) /* Bit 23: External Event 3 */
#define HRTIM_TIMSET1_EXTEVNT4      (1 << 24) /* Bit 24: External Event 4 */
#define HRTIM_TIMSET1_EXTEVNT5      (1 << 25) /* Bit 25: External Event 5 */
#define HRTIM_TIMSET1_EXTEVNT6      (1 << 26) /* Bit 26: External Event 6 */
#define HRTIM_TIMSET1_EXTEVNT7      (1 << 27) /* Bit 27: External Event 7 */
#define HRTIM_TIMSET1_EXTEVNT8      (1 << 28) /* Bit 28: External Event 8 */
#define HRTIM_TIMSET1_EXTEVNT9      (1 << 29) /* Bit 29: External Event 9 */
#define HRTIM_TIMSET1_EXTEVNT10     (1 << 30) /* Bit 30: External Event 10 */
#define HRTIM_TIMSET1_UPDATE        (1 << 31) /* Bit 31: Registers Update */

/* Timer X Output1 Reset Register */

#define HRTIM_TIMRST1_SST           (1 << 0)  /* Bit 0 */
#define HRTIM_TIMRST1_RESYNC        (1 << 1)  /* Bit 1 */
#define HRTIM_TIMRST1_PER           (1 << 2)  /* Bit 2 */
#define HRTIM_TIMRST1_CMP1          (1 << 3)  /* Bit 3 */
#define HRTIM_TIMRST1_CMP2          (1 << 4)  /* Bit 4 */
#define HRTIM_TIMRST1_CMP3          (1 << 5)  /* Bit 5 */
#define HRTIM_TIMRST1_CMP4          (1 << 6)  /* Bit 6 */
#define HRTIM_TIMRST1_MSTPER        (1 << 7)  /* Bit 7 */
#define HRTIM_TIMRST1_MSTCMP1       (1 << 8)  /* Bit 8 */
#define HRTIM_TIMRST1_MSTCMP2       (1 << 9)  /* Bit 9 */
#define HRTIM_TIMRST1_MSTCMP3       (1 << 10) /* Bit 10 */
#define HRTIM_TIMRST1_MSTCMP4       (1 << 11) /* Bit 11 */
#define HRTIM_TIMRST1_TIMEVNT1      (1 << 12) /* Bit 12 */
#define HRTIM_TIMRST1_TIMEVNT2      (1 << 13) /* Bit 13 */
#define HRTIM_TIMRST1_TIMEVNT3      (1 << 14) /* Bit 14 */
#define HRTIM_TIMRST1_TIMEVNT4      (1 << 15) /* Bit 15 */
#define HRTIM_TIMRST1_TIMEVNT5      (1 << 16) /* Bit 16 */
#define HRTIM_TIMRST1_TIMEVNT6      (1 << 17) /* Bit 17 */
#define HRTIM_TIMRST1_TIMEVNT7      (1 << 18) /* Bit 18 */
#define HRTIM_TIMRST1_TIMEVNT8      (1 << 19) /* Bit 19 */
#define HRTIM_TIMRST1_TIMEVNT9      (1 << 20) /* Bit 20 */
#define HRTIM_TIMRST1_EXTEVNT1      (1 << 21) /* Bit 21 */
#define HRTIM_TIMRST1_EXTEVNT2      (1 << 22) /* Bit 22 */
#define HRTIM_TIMRST1_EXTEVNT3      (1 << 23) /* Bit 23 */
#define HRTIM_TIMRST1_EXTEVNT4      (1 << 24) /* Bit 24 */
#define HRTIM_TIMRST1_EXTEVNT5      (1 << 25) /* Bit 25 */
#define HRTIM_TIMRST1_EXTEVNT6      (1 << 26) /* Bit 26 */
#define HRTIM_TIMRST1_EXTEVNT7      (1 << 27) /* Bit 27 */
#define HRTIM_TIMRST1_EXTEVNT8      (1 << 28) /* Bit 28 */
#define HRTIM_TIMRST1_EXTEVNT9      (1 << 29) /* Bit 29 */
#define HRTIM_TIMRST1_EXTEVNT10     (1 << 30) /* Bit 30 */
#define HRTIM_TIMRST1_UPDATE        (1 << 31) /* Bit 31 */

/* Timer X Output2 Set Register */

