apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g47xxx_hrtim.h
#define HRTIM_TIMSET2_SST           (1 << 0)  /* Bit 0 */
#define HRTIM_TIMSET2_RESYNC        (1 << 1)  /* Bit 1 */
#define HRTIM_TIMSET2_PER           (1 << 2)  /* Bit 2 */
#define HRTIM_TIMSET2_CMP1          (1 << 3)  /* Bit 3 */
#define HRTIM_TIMSET2_CMP2          (1 << 4)  /* Bit 4 */
#define HRTIM_TIMSET2_CMP3          (1 << 5)  /* Bit 5 */
#define HRTIM_TIMSET2_CMP4          (1 << 6)  /* Bit 6 */
#define HRTIM_TIMSET2_MSTPER        (1 << 7)  /* Bit 7 */
#define HRTIM_TIMSET2_MSTCMP1       (1 << 8)  /* Bit 8 */
#define HRTIM_TIMSET2_MSTCMP2       (1 << 9)  /* Bit 9 */
#define HRTIM_TIMSET2_MSTCMP3       (1 << 10) /* Bit 10 */
#define HRTIM_TIMSET2_MSTCMP4       (1 << 11) /* Bit 11 */
#define HRTIM_TIMSET2_TIMEVNT1      (1 << 12) /* Bit 12 */
#define HRTIM_TIMSET2_TIMEVNT2      (1 << 13) /* Bit 13 */
#define HRTIM_TIMSET2_TIMEVNT3      (1 << 14) /* Bit 14 */
#define HRTIM_TIMSET2_TIMEVNT4      (1 << 15) /* Bit 15 */
#define HRTIM_TIMSET2_TIMEVNT5      (1 << 16) /* Bit 16 */
#define HRTIM_TIMSET2_TIMEVNT6      (1 << 17) /* Bit 17 */
#define HRTIM_TIMSET2_TIMEVNT7      (1 << 18) /* Bit 18 */
#define HRTIM_TIMSET2_TIMEVNT8      (1 << 19) /* Bit 19 */
#define HRTIM_TIMSET2_TIMEVNT9      (1 << 20) /* Bit 20 */
#define HRTIM_TIMSET2_EXTEVNT1      (1 << 21) /* Bit 21 */
#define HRTIM_TIMSET2_EXTEVNT2      (1 << 22) /* Bit 22 */
#define HRTIM_TIMSET2_EXTEVNT3      (1 << 23) /* Bit 23 */
#define HRTIM_TIMSET2_EXTEVNT4      (1 << 24) /* Bit 24 */
#define HRTIM_TIMSET2_EXTEVNT5      (1 << 25) /* Bit 25 */
#define HRTIM_TIMSET2_EXTEVNT6      (1 << 26) /* Bit 26 */
#define HRTIM_TIMSET2_EXTEVNT7      (1 << 27) /* Bit 27 */
#define HRTIM_TIMSET2_EXTEVNT8      (1 << 28) /* Bit 28 */
#define HRTIM_TIMSET2_EXTEVNT9      (1 << 29) /* Bit 29 */
#define HRTIM_TIMSET2_EXTEVNT10     (1 << 30) /* Bit 30 */
#define HRTIM_TIMSET2_UPDATE        (1 << 31) /* Bit 31 */

/* Timer X Output2 Reset Register */

#define HRTIM_TIMRST2_SST           (1 << 0)  /* Bit 0 */
#define HRTIM_TIMRST2_RESYNC        (1 << 1)  /* Bit 1 */
#define HRTIM_TIMRST2_PER           (1 << 2)  /* Bit 2 */
#define HRTIM_TIMRST2_CMP1          (1 << 3)  /* Bit 3 */
#define HRTIM_TIMRST2_CMP2          (1 << 4)  /* Bit 4 */
#define HRTIM_TIMRST2_CMP3          (1 << 5)  /* Bit 5 */
#define HRTIM_TIMRST2_CMP4          (1 << 6)  /* Bit 6 */
#define HRTIM_TIMRST2_MSTPER        (1 << 7)  /* Bit 7 */
#define HRTIM_TIMRST2_MSTCMP1       (1 << 8)  /* Bit 8 */
#define HRTIM_TIMRST2_MSTCMP2       (1 << 9)  /* Bit 9 */
#define HRTIM_TIMRST2_MSTCMP3       (1 << 10) /* Bit 10 */
#define HRTIM_TIMRST2_MSTCMP4       (1 << 11) /* Bit 11 */
#define HRTIM_TIMRST2_TIMEVNT1      (1 << 12) /* Bit 12 */
#define HRTIM_TIMRST2_TIMEVNT2      (1 << 13) /* Bit 13 */
#define HRTIM_TIMRST2_TIMEVNT3      (1 << 14) /* Bit 14 */
#define HRTIM_TIMRST2_TIMEVNT4      (1 << 15) /* Bit 15 */
#define HRTIM_TIMRST2_TIMEVNT5      (1 << 16) /* Bit 16 */
#define HRTIM_TIMRST2_TIMEVNT6      (1 << 17) /* Bit 17 */
#define HRTIM_TIMRST2_TIMEVNT7      (1 << 18) /* Bit 18 */
#define HRTIM_TIMRST2_TIMEVNT8      (1 << 19) /* Bit 19 */
#define HRTIM_TIMRST2_TIMEVNT9      (1 << 20) /* Bit 20 */
#define HRTIM_TIMRST2_EXTEVNT1      (1 << 21) /* Bit 21 */
#define HRTIM_TIMRST2_EXTEVNT2      (1 << 22) /* Bit 22 */
#define HRTIM_TIMRST2_EXTEVNT3      (1 << 23) /* Bit 23 */
#define HRTIM_TIMRST2_EXTEVNT4      (1 << 24) /* Bit 24 */
#define HRTIM_TIMRST2_EXTEVNT5      (1 << 25) /* Bit 25 */
#define HRTIM_TIMRST2_EXTEVNT6      (1 << 26) /* Bit 26 */
#define HRTIM_TIMRST2_EXTEVNT7      (1 << 27) /* Bit 27 */
#define HRTIM_TIMRST2_EXTEVNT8      (1 << 28) /* Bit 28 */
#define HRTIM_TIMRST2_EXTEVNT9      (1 << 29) /* Bit 29 */
#define HRTIM_TIMRST2_EXTEVNT10     (1 << 30) /* Bit 30 */
#define HRTIM_TIMRST2_UPDATE        (1 << 31) /* Bit 31 */

/* Timer X External Event Filtering Register 1 */

#define HRTIM_TIMEEF1_EE1LTCH       (1 << 0) /* Bit 0: External Event 1 Latch */
#define HRTIM_TIMEEF1_EE1FLT_SHIFT  1        /* Bits 1-4: External Event 1 Filter */
#define HRTIM_TIMEEF1_EE1FLT_MASK   (15 << HRTIM_TIMEEF1_EE1FLT_SHIFT)
#  define HRTIM_TIMEEF1_EE1FLT_0    (0 << HRTIM_TIMEEF1_EE1FLT_SHIFT)  /* 0000: No filtering */
#  define HRTIM_TIMEEF1_EE1FLT_1    (1 << HRTIM_TIMEEF1_EE1FLT_SHIFT)  /* 0001: Blanking from counter reset/roll-over to Compare 1 */
#  define HRTIM_TIMEEF1_EE1FLT_2    (2 << HRTIM_TIMEEF1_EE1FLT_SHIFT)  /* 0010: Blanking from counter reset/roll-over to Compare 2 */
#  define HRTIM_TIMEEF1_EE1FLT_3    (3 << HRTIM_TIMEEF1_EE1FLT_SHIFT)  /* 0011: Blanking from counter reset/roll-over to Compare 3 */
#  define HRTIM_TIMEEF1_EE1FLT_4    (4 << HRTIM_TIMEEF1_EE1FLT_SHIFT)  /* 0100: Blanking from counter reset/roll-over to Compare 4 */
#  define HRTIM_TIMEEF1_EE1FLT_5    (5 << HRTIM_TIMEEF1_EE1FLT_SHIFT)  /* 0101: Blanking from TIMFLTR1 source */
#  define HRTIM_TIMEEF1_EE1FLT_6    (6 << HRTIM_TIMEEF1_EE1FLT_SHIFT)  /* 0110: Blanking from TIMFLTR2 source */
#  define HRTIM_TIMEEF1_EE1FLT_7    (7 << HRTIM_TIMEEF1_EE1FLT_SHIFT)  /* 0111: Blanking from TIMFLTR3 source */
#  define HRTIM_TIMEEF1_EE1FLT_8    (8 << HRTIM_TIMEEF1_EE1FLT_SHIFT)  /* 1000: Blanking from TIMFLTR4 source */
#  define HRTIM_TIMEEF1_EE1FLT_9    (9 << HRTIM_TIMEEF1_EE1FLT_SHIFT)  /* 1001: Blanking from TIMFLTR5 source */
#  define HRTIM_TIMEEF1_EE1FLT_10   (10 << HRTIM_TIMEEF1_EE1FLT_SHIFT) /* 1010: Blanking from TIMFLTR6 source */
#  define HRTIM_TIMEEF1_EE1FLT_11   (11 << HRTIM_TIMEEF1_EE1FLT_SHIFT) /* 1011: Blanking from TIMFLTR7 source */
#  define HRTIM_TIMEEF1_EE1FLT_12   (12 << HRTIM_TIMEEF1_EE1FLT_SHIFT) /* 1100: Blanking from TIMFLTR8 source */
#  define HRTIM_TIMEEF1_EE1FLT_13   (13 << HRTIM_TIMEEF1_EE1FLT_SHIFT) /* 1101: Windowing from counter reset/roll-over to Compare 2 */
#  define HRTIM_TIMEEF1_EE1FLT_14   (14 << HRTIM_TIMEEF1_EE1FLT_SHIFT) /* 1110: Windowing from counter reset/roll-over to Compare 3 */
#  define HRTIM_TIMEEF1_EE1FLT_15   (15 << HRTIM_TIMEEF1_EE1FLT_SHIFT) /* 1111: Windowing from TIMWIN source */
#define HRTIM_TIMEEF1_EE2LTCH       (1 << 6)                           /* Bit 6: External Event 2 Lack */
#define HRTIM_TIMEEF1_EE2FLT_SHIFT  7                                  /* Bits 7-10: Externl Event 2 Filter */
#define HRTIM_TIMEEF1_EE2FLT_MASK   (15 << HRTIM_TIMEEF1_EE2FLT_SHIFT)
#  define HRTIM_TIMEEF1_EE2FLT_0    (0 << HRTIM_TIMEEF1_EE2FLT_SHIFT)  /* 0000: No filtering */
#  define HRTIM_TIMEEF1_EE2FLT_1    (1 << HRTIM_TIMEEF1_EE2FLT_SHIFT)  /* 0001: Blanking from counter reset/roll-over to Compare 1 */
#  define HRTIM_TIMEEF1_EE2FLT_2    (2 << HRTIM_TIMEEF1_EE2FLT_SHIFT)  /* 0010: Blanking from counter reset/roll-over to Compare 2 */
#  define HRTIM_TIMEEF1_EE2FLT_3    (3 << HRTIM_TIMEEF1_EE2FLT_SHIFT)  /* 0011: Blanking from counter reset/roll-over to Compare 3 */
#  define HRTIM_TIMEEF1_EE2FLT_4    (4 << HRTIM_TIMEEF1_EE2FLT_SHIFT)  /* 0100: Blanking from counter reset/roll-over to Compare 4 */
#  define HRTIM_TIMEEF1_EE2FLT_5    (5 << HRTIM_TIMEEF1_EE2FLT_SHIFT)  /* 0101: Blanking from TIMFLTR1 source */
#  define HRTIM_TIMEEF1_EE2FLT_6    (6 << HRTIM_TIMEEF1_EE2FLT_SHIFT)  /* 0110: Blanking from TIMFLTR2 source */
#  define HRTIM_TIMEEF1_EE2FLT_7    (7 << HRTIM_TIMEEF1_EE2FLT_SHIFT)  /* 0111: Blanking from TIMFLTR3 source */
#  define HRTIM_TIMEEF1_EE2FLT_8    (8 << HRTIM_TIMEEF1_EE2FLT_SHIFT)  /* 1000: Blanking from TIMFLTR4 source */
#  define HRTIM_TIMEEF1_EE2FLT_9    (9 << HRTIM_TIMEEF1_EE2FLT_SHIFT)  /* 1001: Blanking from TIMFLTR5 source */
#  define HRTIM_TIMEEF1_EE2FLT_10   (10 << HRTIM_TIMEEF1_EE2FLT_SHIFT) /* 1010: Blanking from TIMFLTR6 source */
#  define HRTIM_TIMEEF1_EE2FLT_11   (11 << HRTIM_TIMEEF1_EE2FLT_SHIFT) /* 1011: Blanking from TIMFLTR7 source */
#  define HRTIM_TIMEEF1_EE2FLT_12   (12 << HRTIM_TIMEEF1_EE2FLT_SHIFT) /* 1100: Blanking from TIMFLTR8 source */
#  define HRTIM_TIMEEF1_EE2FLT_13   (13 << HRTIM_TIMEEF1_EE2FLT_SHIFT) /* 1101: Windowing from counter reset/roll-over to Compare 2 */
#  define HRTIM_TIMEEF1_EE2FLT_14   (14 << HRTIM_TIMEEF1_EE2FLT_SHIFT) /* 1110: Windowing from counter reset/roll-over to Compare 3 */
#  define HRTIM_TIMEEF1_EE2FLT_15   (15 << HRTIM_TIMEEF1_EE2FLT_SHIFT) /* 1111: Windowing from TIMWIN source */
#define HRTIM_TIMEEF1_EE3LTCH       (1 << 12)                          /* Bit 12: External Event 3 Lack */
#define HRTIM_TIMEEF1_EE3FLT_SHIFT  13                                 /* Bits 13-16: Externl Event 3 Filter */
#define HRTIM_TIMEEF1_EE3FLT_MASK   (15 << HRTIM_TIMEEF1_EE3FLT_SHIFT)
#  define HRTIM_TIMEEF1_EE3FLT_0    (0 << HRTIM_TIMEEF1_EE3FLT_SHIFT)  /* 0000: No filtering */
#  define HRTIM_TIMEEF1_EE3FLT_1    (1 << HRTIM_TIMEEF1_EE3FLT_SHIFT)  /* 0001: Blanking from counter reset/roll-over to Compare 1 */
#  define HRTIM_TIMEEF1_EE3FLT_2    (2 << HRTIM_TIMEEF1_EE3FLT_SHIFT)  /* 0010: Blanking from counter reset/roll-over to Compare 2 */
#  define HRTIM_TIMEEF1_EE3FLT_3    (3 << HRTIM_TIMEEF1_EE3FLT_SHIFT)  /* 0011: Blanking from counter reset/roll-over to Compare 3 */
#  define HRTIM_TIMEEF1_EE3FLT_4    (4 << HRTIM_TIMEEF1_EE3FLT_SHIFT)  /* 0100: Blanking from counter reset/roll-over to Compare 4 */
#  define HRTIM_TIMEEF1_EE3FLT_5    (5 << HRTIM_TIMEEF1_EE3FLT_SHIFT)  /* 0101: Blanking from TIMFLTR1 source */
#  define HRTIM_TIMEEF1_EE3FLT_6    (6 << HRTIM_TIMEEF1_EE3FLT_SHIFT)  /* 0110: Blanking from TIMFLTR2 source */
#  define HRTIM_TIMEEF1_EE3FLT_7    (7 << HRTIM_TIMEEF1_EE3FLT_SHIFT)  /* 0111: Blanking from TIMFLTR3 source */
#  define HRTIM_TIMEEF1_EE3FLT_8    (8 << HRTIM_TIMEEF1_EE3FLT_SHIFT)  /* 1000: Blanking from TIMFLTR4 source */
#  define HRTIM_TIMEEF1_EE3FLT_9    (9 << HRTIM_TIMEEF1_EE3FLT_SHIFT)  /* 1001: Blanking from TIMFLTR5 source */
#  define HRTIM_TIMEEF1_EE3FLT_10   (10 << HRTIM_TIMEEF1_EE3FLT_SHIFT) /* 1010: Blanking from TIMFLTR6 source */
#  define HRTIM_TIMEEF1_EE3FLT_11   (11 << HRTIM_TIMEEF1_EE3FLT_SHIFT) /* 1011: Blanking from TIMFLTR7 source */
#  define HRTIM_TIMEEF1_EE3FLT_12   (12 << HRTIM_TIMEEF1_EE3FLT_SHIFT) /* 1100: Blanking from TIMFLTR8 source */
#  define HRTIM_TIMEEF1_EE3FLT_13   (13 << HRTIM_TIMEEF1_EE3FLT_SHIFT) /* 1101: Windowing from counter reset/roll-over to Compare 2 */
#  define HRTIM_TIMEEF1_EE3FLT_14   (14 << HRTIM_TIMEEF1_EE3FLT_SHIFT) /* 1110: Windowing from counter reset/roll-over to Compare 3 */
#  define HRTIM_TIMEEF1_EE3FLT_15   (15 << HRTIM_TIMEEF1_EE3FLT_SHIFT) /* 1111: Windowing from TIMWIN source */
#define HRTIM_TIMEEF1_EE4LTCH       (1 << 18)                          /* Bit 18: External Event 4 Lack */
#define HRTIM_TIMEEF1_EE4FLT_SHIFT  19                                 /* Bits 19-22: Externl Event 4 Filter */
#define HRTIM_TIMEEF1_EE4FLT_MASK   (15 << HRTIM_TIMEEF1_EE4FLT_SHIFT)
#  define HRTIM_TIMEEF1_EE4FLT_0    (0 << HRTIM_TIMEEF1_EE4FLT_SHIFT)  /* 0000: No filtering */
#  define HRTIM_TIMEEF1_EE4FLT_1    (1 << HRTIM_TIMEEF1_EE4FLT_SHIFT)  /* 0001: Blanking from counter reset/roll-over to Compare 1 */
#  define HRTIM_TIMEEF1_EE4FLT_2    (2 << HRTIM_TIMEEF1_EE4FLT_SHIFT)  /* 0010: Blanking from counter reset/roll-over to Compare 2 */
#  define HRTIM_TIMEEF1_EE4FLT_3    (3 << HRTIM_TIMEEF1_EE4FLT_SHIFT)  /* 0011: Blanking from counter reset/roll-over to Compare 3 */
#  define HRTIM_TIMEEF1_EE4FLT_4    (4 << HRTIM_TIMEEF1_EE4FLT_SHIFT)  /* 0100: Blanking from counter reset/roll-over to Compare 4 */
#  define HRTIM_TIMEEF1_EE4FLT_5    (5 << HRTIM_TIMEEF1_EE4FLT_SHIFT)  /* 0101: Blanking from TIMFLTR1 source */
#  define HRTIM_TIMEEF1_EE4FLT_6    (6 << HRTIM_TIMEEF1_EE4FLT_SHIFT)  /* 0110: Blanking from TIMFLTR2 source */
#  define HRTIM_TIMEEF1_EE4FLT_7    (7 << HRTIM_TIMEEF1_EE4FLT_SHIFT)  /* 0111: Blanking from TIMFLTR3 source */
#  define HRTIM_TIMEEF1_EE4FLT_8    (8 << HRTIM_TIMEEF1_EE4FLT_SHIFT)  /* 1000: Blanking from TIMFLTR4 source */
#  define HRTIM_TIMEEF1_EE4FLT_9    (9 << HRTIM_TIMEEF1_EE4FLT_SHIFT)  /* 1001: Blanking from TIMFLTR5 source */
#  define HRTIM_TIMEEF1_EE4FLT_10   (10 << HRTIM_TIMEEF1_EE4FLT_SHIFT) /* 1010: Blanking from TIMFLTR6 source */
#  define HRTIM_TIMEEF1_EE4FLT_11   (11 << HRTIM_TIMEEF1_EE4FLT_SHIFT) /* 1011: Blanking from TIMFLTR7 source */
#  define HRTIM_TIMEEF1_EE4FLT_12   (12 << HRTIM_TIMEEF1_EE4FLT_SHIFT) /* 1100: Blanking from TIMFLTR8 source */
#  define HRTIM_TIMEEF1_EE4FLT_13   (13 << HRTIM_TIMEEF1_EE4FLT_SHIFT) /* 1101: Windowing from counter reset/roll-over to Compare 2 */
#  define HRTIM_TIMEEF1_EE4FLT_14   (14 << HRTIM_TIMEEF1_EE4FLT_SHIFT) /* 1110: Windowing from counter reset/roll-over to Compare 3 */
#  define HRTIM_TIMEEF1_EE4FLT_15   (15 << HRTIM_TIMEEF1_EE4FLT_SHIFT) /* 1111: Windowing from TIMWIN source */
#define HRTIM_TIMEEF1_EE5LTCH       (1 << 24)                          /* Bit 24: External Event 5 Lack */
#define HRTIM_TIMEEF1_EE5FLT_SHIFT  25                                 /* Bits 25-28: Externl Event 5 Filter */
#define HRTIM_TIMEEF1_EE5FLT_MASK   (15 << HRTIM_TIMEEF1_EE5FLT_SHIFT)
#  define HRTIM_TIMEEF1_EE5FLT_0    (0 << HRTIM_TIMEEF1_EE5FLT_SHIFT)  /* 0000: No filtering */
#  define HRTIM_TIMEEF1_EE5FLT_1    (1 << HRTIM_TIMEEF1_EE5FLT_SHIFT)  /* 0001: Blanking from counter reset/roll-over to Compare 1 */
#  define HRTIM_TIMEEF1_EE5FLT_2    (2 << HRTIM_TIMEEF1_EE5FLT_SHIFT)  /* 0010: Blanking from counter reset/roll-over to Compare 2 */
#  define HRTIM_TIMEEF1_EE5FLT_3    (3 << HRTIM_TIMEEF1_EE5FLT_SHIFT)  /* 0011: Blanking from counter reset/roll-over to Compare 3 */
#  define HRTIM_TIMEEF1_EE5FLT_4    (4 << HRTIM_TIMEEF1_EE5FLT_SHIFT)  /* 0100: Blanking from counter reset/roll-over to Compare 4 */
#  define HRTIM_TIMEEF1_EE5FLT_5    (5 << HRTIM_TIMEEF1_EE5FLT_SHIFT)  /* 0101: Blanking from TIMFLTR1 source */
#  define HRTIM_TIMEEF1_EE5FLT_6    (6 << HRTIM_TIMEEF1_EE5FLT_SHIFT)  /* 0110: Blanking from TIMFLTR2 source */
#  define HRTIM_TIMEEF1_EE5FLT_7    (7 << HRTIM_TIMEEF1_EE5FLT_SHIFT)  /* 0111: Blanking from TIMFLTR3 source */
#  define HRTIM_TIMEEF1_EE5FLT_8    (8 << HRTIM_TIMEEF1_EE5FLT_SHIFT)  /* 1000: Blanking from TIMFLTR4 source */
#  define HRTIM_TIMEEF1_EE5FLT_9    (9 << HRTIM_TIMEEF1_EE5FLT_SHIFT)  /* 1001: Blanking from TIMFLTR5 source */
#  define HRTIM_TIMEEF1_EE5FLT_10   (10 << HRTIM_TIMEEF1_EE5FLT_SHIFT) /* 1010: Blanking from TIMFLTR6 source */
#  define HRTIM_TIMEEF1_EE5FLT_11   (11 << HRTIM_TIMEEF1_EE5FLT_SHIFT) /* 1011: Blanking from TIMFLTR7 source */
#  define HRTIM_TIMEEF1_EE5FLT_12   (12 << HRTIM_TIMEEF1_EE5FLT_SHIFT) /* 1100: Blanking from TIMFLTR8 source */
#  define HRTIM_TIMEEF1_EE5FLT_13   (13 << HRTIM_TIMEEF1_EE5FLT_SHIFT) /* 1101: Windowing from counter reset/roll-over to Compare 2 */
#  define HRTIM_TIMEEF1_EE5FLT_14   (14 << HRTIM_TIMEEF1_EE5FLT_SHIFT) /* 1110: Windowing from counter reset/roll-over to Compare 3 */
#  define HRTIM_TIMEEF1_EE5FLT_15   (15 << HRTIM_TIMEEF1_EE5FLT_SHIFT) /* 1111: Windowing from TIMWIN source */

/* Timer X External Event Filtering Register 2 */

