apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g47xxx_hrtim.h
/* Timer X Reset Register */

#define HRTIM_TIMARST_TIMFCMP1        (1 << 0)  /* Bit 0: Timer F compare 1 */
#define HRTIM_TIMARST_UPDT            (1 << 1)  /* Bit 1: Timer A update reset */
#define HRTIM_TIMARST_CMP2            (1 << 2)  /* Bit 2: Timer A compare 2 reset */
#define HRTIM_TIMARST_CMP4            (1 << 3)  /* Bit 3: Timer A compare 4 reset */
#define HRTIM_TIMARST_MSTPER          (1 << 4)  /* Bit 4: Master timer period */
#define HRTIM_TIMARST_MSTCMP1         (1 << 5)  /* Bit 5: Master compare 1 */
#define HRTIM_TIMARST_MSTCMP2         (1 << 6)  /* Bit 6: Master compare 2 */
#define HRTIM_TIMARST_MSTCMP3         (1 << 7)  /* Bit 7: Master compare 3 */
#define HRTIM_TIMARST_MSTCMP4         (1 << 8)  /* Bit 8: Master compare 4 */
#define HRTIM_TIMARST_EXTEVNT1        (1 << 9)  /* Bit 9: External event 1 */
#define HRTIM_TIMARST_EXTEVNT2        (1 << 10) /* Bit 10: External event 2 */
#define HRTIM_TIMARST_EXTEVNT3        (1 << 11) /* Bit 11: External event 3 */
#define HRTIM_TIMARST_EXTEVNT4        (1 << 12) /* Bit 12: External event 4 */
#define HRTIM_TIMARST_EXTEVNT5        (1 << 13) /* Bit 13: External event 5 */
#define HRTIM_TIMARST_EXTEVNT6        (1 << 14) /* Bit 14: External event 6 */
#define HRTIM_TIMARST_EXTEVNT7        (1 << 15) /* Bit 15: External event 7 */
#define HRTIM_TIMARST_EXTEVNT8        (1 << 16) /* Bit 16: External event 8 */
#define HRTIM_TIMARST_EXTEVNT9        (1 << 17) /* Bit 17: External event 9 */
#define HRTIM_TIMARST_EXTEVNT10       (1 << 18) /* Bit 18: External event 10 */
#define HRTIM_TIMARST_TIMBCMP1        (1 << 19) /* Bit 19: Timer B compare 1 */
#define HRTIM_TIMARST_TIMBCMP2        (1 << 20) /* Bit 20: Timer B compare 2 */
#define HRTIM_TIMARST_TIMBCMP4        (1 << 21) /* Bit 21: Timer B compare 4 */
#define HRTIM_TIMARST_TIMCCMP1        (1 << 22) /* Bit 22: Timer C compare 1 */
#define HRTIM_TIMARST_TIMCCMP2        (1 << 23) /* Bit 23: Timer C compare 2 */
#define HRTIM_TIMARST_TIMCCMP4        (1 << 24) /* Bit 24: Timer C compare 4 */
#define HRTIM_TIMARST_TIMDCMP1        (1 << 25) /* Bit 25: Timer D compare 1 */
#define HRTIM_TIMARST_TIMDCMP2        (1 << 26) /* Bit 26: Timer D compare 2 */
#define HRTIM_TIMARST_TIMDCMP4        (1 << 27) /* Bit 27: Timer D compare 4 */
#define HRTIM_TIMARST_TIMECMP1        (1 << 28) /* Bit 28: Timer E compare 1 */
#define HRTIM_TIMARST_TIMECMP2        (1 << 29) /* Bit 29: Timer E compare 2 */
#define HRTIM_TIMARST_TIMECMP4        (1 << 30) /* Bit 30: Timer E compare 4 */
#define HRTIM_TIMARST_TIMFCMP2        (1 << 31) /* Bit 31: Timer F compare 2 */

#define HRTIM_TIMBRST_TIMFCMP1        (1 << 0)  /* Bit 0: Timer F compare 1 */
#define HRTIM_TIMBRST_UPDT            (1 << 1)  /* Bit 1: Timer B update reset */
#define HRTIM_TIMBRST_CMP2            (1 << 2)  /* Bit 2: Timer B compare 2 reset */
#define HRTIM_TIMBRST_CMP4            (1 << 3)  /* Bit 3: Timer B compare 4 reset */
#define HRTIM_TIMBRST_MSTPER          (1 << 4)  /* Bit 4: Master timer period */
#define HRTIM_TIMBRST_MSTCMP1         (1 << 5)  /* Bit 5: Master compare 1 */
#define HRTIM_TIMBRST_MSTCMP2         (1 << 6)  /* Bit 6: Master compare 2 */
#define HRTIM_TIMBRST_MSTCMP3         (1 << 7)  /* Bit 7: Master compare 3 */
#define HRTIM_TIMBRST_MSTCMP4         (1 << 8)  /* Bit 8: Master compare 4 */
#define HRTIM_TIMBRST_EXTEVNT1        (1 << 9)  /* Bit 9: External event 1 */
#define HRTIM_TIMBRST_EXTEVNT2        (1 << 10) /* Bit 10: External event 2 */
#define HRTIM_TIMBRST_EXTEVNT3        (1 << 11) /* Bit 11: External event 3 */
#define HRTIM_TIMBRST_EXTEVNT4        (1 << 12) /* Bit 12: External event 4 */
#define HRTIM_TIMBRST_EXTEVNT5        (1 << 13) /* Bit 13: External event 5 */
#define HRTIM_TIMBRST_EXTEVNT6        (1 << 14) /* Bit 14: External event 6 */
#define HRTIM_TIMBRST_EXTEVNT7        (1 << 15) /* Bit 15: External event 7 */
#define HRTIM_TIMBRST_EXTEVNT8        (1 << 16) /* Bit 16: External event 8 */
#define HRTIM_TIMBRST_EXTEVNT9        (1 << 17) /* Bit 17: External event 9 */
#define HRTIM_TIMBRST_EXTEVNT10       (1 << 18) /* Bit 18: External event 10 */
#define HRTIM_TIMBRST_TIMACMP1        (1 << 19) /* Bit 19: Timer A compare 1 */
#define HRTIM_TIMBRST_TIMACMP2        (1 << 20) /* Bit 20: Timer A compare 2 */
#define HRTIM_TIMBRST_TIMACMP4        (1 << 21) /* Bit 21: Timer A compare 4 */
#define HRTIM_TIMBRST_TIMCCMP1        (1 << 22) /* Bit 22: Timer C compare 1 */
#define HRTIM_TIMBRST_TIMCCMP2        (1 << 23) /* Bit 23: Timer C compare 2 */
#define HRTIM_TIMBRST_TIMCCMP4        (1 << 24) /* Bit 24: Timer C compare 4 */
#define HRTIM_TIMBRST_TIMDCMP1        (1 << 25) /* Bit 25: Timer D compare 1 */
#define HRTIM_TIMBRST_TIMDCMP2        (1 << 26) /* Bit 26: Timer D compare 2 */
#define HRTIM_TIMBRST_TIMDCMP4        (1 << 27) /* Bit 27: Timer D compare 4 */
#define HRTIM_TIMBRST_TIMECMP1        (1 << 28) /* Bit 28: Timer E compare 1 */
#define HRTIM_TIMBRST_TIMECMP2        (1 << 29) /* Bit 29: Timer E compare 2 */
#define HRTIM_TIMBRST_TIMECMP4        (1 << 30) /* Bit 30: Timer D compare 4 */
#define HRTIM_TIMBRST_TIMFCMP2        (1 << 31) /* Bit 30: Timer F compare 2 */

#define HRTIM_TIMCRST_TIMFCMP1        (1 << 0)  /* Bit 0: Timer F compare 1 */
#define HRTIM_TIMCRST_UPDT            (1 << 1)  /* Bit 1: Timer C update reset */
#define HRTIM_TIMCRST_CMP2            (1 << 2)  /* Bit 2: Timer C compare 2 reset */
#define HRTIM_TIMCRST_CMP4            (1 << 3)  /* Bit 3: Timer C compare 4 reset */
#define HRTIM_TIMCRST_MSTPER          (1 << 4)  /* Bit 4: Master timer period */
#define HRTIM_TIMCRST_MSTCMP1         (1 << 5)  /* Bit 5: Master compare 1 */
#define HRTIM_TIMCRST_MSTCMP2         (1 << 6)  /* Bit 6: Master compare 2 */
#define HRTIM_TIMCRST_MSTCMP3         (1 << 7)  /* Bit 7: Master compare 3 */
#define HRTIM_TIMCRST_MSTCMP4         (1 << 8)  /* Bit 8: Master compare 4 */
#define HRTIM_TIMCRST_EXTEVNT1        (1 << 9)  /* Bit 9: External event 1 */
#define HRTIM_TIMCRST_EXTEVNT2        (1 << 10) /* Bit 10: External event 2 */
#define HRTIM_TIMCRST_EXTEVNT3        (1 << 11) /* Bit 11: External event 3 */
#define HRTIM_TIMCRST_EXTEVNT4        (1 << 12) /* Bit 12: External event 4 */
#define HRTIM_TIMCRST_EXTEVNT5        (1 << 13) /* Bit 13: External event 5 */
#define HRTIM_TIMCRST_EXTEVNT6        (1 << 14) /* Bit 14: External event 6 */
#define HRTIM_TIMCRST_EXTEVNT7        (1 << 15) /* Bit 15: External event 7 */
#define HRTIM_TIMCRST_EXTEVNT8        (1 << 16) /* Bit 16: External event 8 */
#define HRTIM_TIMCRST_EXTEVNT9        (1 << 17) /* Bit 17: External event 9 */
#define HRTIM_TIMCRST_EXTEVNT10       (1 << 18) /* Bit 18: External event 10 */
#define HRTIM_TIMCRST_TIMACMP1        (1 << 19) /* Bit 19: Timer A compare 1 */
#define HRTIM_TIMCRST_TIMACMP2        (1 << 20) /* Bit 20: Timer A compare 2 */
#define HRTIM_TIMCRST_TIMACMP4        (1 << 21) /* Bit 21: Timer A compare 4 */
#define HRTIM_TIMCRST_TIMBCMP1        (1 << 22) /* Bit 22: Timer B compare 1 */
#define HRTIM_TIMCRST_TIMBCMP2        (1 << 23) /* Bit 23: Timer B compare 2 */
#define HRTIM_TIMCRST_TIMBCMP4        (1 << 24) /* Bit 24: Timer B compare 4 */
#define HRTIM_TIMCRST_TIMDCMP1        (1 << 25) /* Bit 25: Timer D compare 1 */
#define HRTIM_TIMCRST_TIMDCMP2        (1 << 26) /* Bit 26: Timer D compare 2 */
#define HRTIM_TIMCRST_TIMDCMP4        (1 << 27) /* Bit 27: Timer D compare 4 */
#define HRTIM_TIMCRST_TIMECMP1        (1 << 28) /* Bit 28: Timer E compare 1 */
#define HRTIM_TIMCRST_TIMECMP2        (1 << 29) /* Bit 29: Timer E compare 2 */
#define HRTIM_TIMCRST_TIMECMP4        (1 << 30) /* Bit 30: Timer E compare 4 */
#define HRTIM_TIMCRST_TIMFCMP2        (1 << 31) /* Bit 31: Timer F compare 2 */

#define HRTIM_TIMDRST_TIMFCMP1        (1 << 0)  /* Bit 0: Timer F compare 1 */
#define HRTIM_TIMDRST_UPDT            (1 << 1)  /* Bit 1: Timer D update reset */
#define HRTIM_TIMDRST_CMP2            (1 << 2)  /* Bit 2: Timer D compare 2 reset */
#define HRTIM_TIMDRST_CMP4            (1 << 3)  /* Bit 3: Timer D compare 4 reset */
#define HRTIM_TIMDRST_MSTPER          (1 << 4)  /* Bit 4: Master timer period */
#define HRTIM_TIMDRST_MSTCMP1         (1 << 5)  /* Bit 5: Master compare 1 */
#define HRTIM_TIMDRST_MSTCMP2         (1 << 6)  /* Bit 6: Master compare 2 */
#define HRTIM_TIMDRST_MSTCMP3         (1 << 7)  /* Bit 7: Master compare 3 */
#define HRTIM_TIMDRST_MSTCMP4         (1 << 8)  /* Bit 8: Master compare 4 */
#define HRTIM_TIMDRST_EXTEVNT1        (1 << 9)  /* Bit 9: External event 1 */
#define HRTIM_TIMDRST_EXTEVNT2        (1 << 10) /* Bit 10: External event 2 */
#define HRTIM_TIMDRST_EXTEVNT3        (1 << 11) /* Bit 11: External event 3 */
#define HRTIM_TIMDRST_EXTEVNT4        (1 << 12) /* Bit 12: External event 4 */
#define HRTIM_TIMDRST_EXTEVNT5        (1 << 13) /* Bit 13: External event 5 */
#define HRTIM_TIMDRST_EXTEVNT6        (1 << 14) /* Bit 14: External event 6 */
#define HRTIM_TIMDRST_EXTEVNT7        (1 << 15) /* Bit 15: External event 7 */
#define HRTIM_TIMDRST_EXTEVNT8        (1 << 16) /* Bit 16: External event 8 */
#define HRTIM_TIMDRST_EXTEVNT9        (1 << 17) /* Bit 17: External event 9 */
#define HRTIM_TIMDRST_EXTEVNT10       (1 << 18) /* Bit 18: External event 10 */
#define HRTIM_TIMDRST_TIMACMP1        (1 << 19) /* Bit 19: Timer A compare 1 */
#define HRTIM_TIMDRST_TIMACMP2        (1 << 20) /* Bit 20: Timer A compare 2 */
#define HRTIM_TIMDRST_TIMACMP4        (1 << 21) /* Bit 21: Timer A compare 1 */
#define HRTIM_TIMDRST_TIMBCMP1        (1 << 22) /* Bit 22: Timer B compare 1 */
#define HRTIM_TIMDRST_TIMBCMP2        (1 << 23) /* Bit 23: Timer B compare 2 */
#define HRTIM_TIMDRST_TIMBCMP4        (1 << 24) /* Bit 24: Timer B compare 4 */
#define HRTIM_TIMDRST_TIMCCMP1        (1 << 25) /* Bit 25: Timer C compare 1 */
#define HRTIM_TIMDRST_TIMCCMP2        (1 << 26) /* Bit 26: Timer C compare 2 */
#define HRTIM_TIMDRST_TIMCCMP4        (1 << 27) /* Bit 27: Timer C compare 4 */
#define HRTIM_TIMDRST_TIMECMP1        (1 << 28) /* Bit 28: Timer E compare 1 */
#define HRTIM_TIMDRST_TIMECMP2        (1 << 29) /* Bit 29: Timer E compare 2 */
#define HRTIM_TIMDRST_TIMECMP4        (1 << 30) /* Bit 30: Timer E compare 4 */
#define HRTIM_TIMDRST_TIMFCMP2        (1 << 31) /* Bit 31: Timer F compare 2 */

#define HRTIM_TIMERST_TIMFCMP1        (1 << 0)  /* Bit 0: Timer F compare 1 */
#define HRTIM_TIMERST_UPDT            (1 << 1)  /* Bit 1: Timer E update reset */
#define HRTIM_TIMERST_CMP2            (1 << 2)  /* Bit 2: Timer E compare 2 reset */
#define HRTIM_TIMERST_CMP4            (1 << 3)  /* Bit 3: Timer E compare 4 reset */
#define HRTIM_TIMERST_MSTPER          (1 << 4)  /* Bit 4: Master timer period */
#define HRTIM_TIMERST_MSTCMP1         (1 << 5)  /* Bit 5: Master compare 1 */
#define HRTIM_TIMERST_MSTCMP2         (1 << 6)  /* Bit 6: Master compare 2 */
#define HRTIM_TIMERST_MSTCMP3         (1 << 7)  /* Bit 7: Master compare 3 */
#define HRTIM_TIMERST_MSTCMP4         (1 << 8)  /* Bit 8: Master compare 4 */
#define HRTIM_TIMERST_EXTEVNT1        (1 << 9)  /* Bit 9: External event 1 */
#define HRTIM_TIMERST_EXTEVNT2        (1 << 10) /* Bit 10: External event 2 */
#define HRTIM_TIMERST_EXTEVNT3        (1 << 11) /* Bit 11: External event 3 */
#define HRTIM_TIMERST_EXTEVNT4        (1 << 12) /* Bit 12: External event 4 */
#define HRTIM_TIMERST_EXTEVNT5        (1 << 13) /* Bit 13: External event 5 */
#define HRTIM_TIMERST_EXTEVNT6        (1 << 14) /* Bit 14: External event 6 */
#define HRTIM_TIMERST_EXTEVNT7        (1 << 15) /* Bit 15: External event 7 */
#define HRTIM_TIMERST_EXTEVNT8        (1 << 16) /* Bit 16: External event 8 */
#define HRTIM_TIMERST_EXTEVNT9        (1 << 17) /* Bit 17: External event 9 */
#define HRTIM_TIMERST_EXTEVNT10       (1 << 18) /* Bit 18: External event 10 */
#define HRTIM_TIMERST_TIMACMP1        (1 << 19) /* Bit 19: Timer A compare 1 */
#define HRTIM_TIMERST_TIMACMP2        (1 << 20) /* Bit 20: Timer A compare 2 */
#define HRTIM_TIMERST_TIMACMP4        (1 << 21) /* Bit 21: Timer A compare 4 */
#define HRTIM_TIMERST_TIMBCMP1        (1 << 22) /* Bit 22: Timer B compare 1 */
#define HRTIM_TIMERST_TIMBCMP2        (1 << 23) /* Bit 23: Timer B compare 2 */
#define HRTIM_TIMERST_TIMBCMP4        (1 << 24) /* Bit 24: Timer B compare 4 */
#define HRTIM_TIMERST_TIMCCMP1        (1 << 25) /* Bit 25: Timer C compare 1 */
#define HRTIM_TIMERST_TIMCCMP2        (1 << 26) /* Bit 26: Timer C compare 2 */
#define HRTIM_TIMERST_TIMCCMP4        (1 << 27) /* Bit 27: Timer C compare 4 */
#define HRTIM_TIMERST_TIMDCMP1        (1 << 28) /* Bit 28: Timer D compare 1 */
#define HRTIM_TIMERST_TIMDCMP2        (1 << 29) /* Bit 29: Timer D compare 2 */
#define HRTIM_TIMERST_TIMDCMP4        (1 << 30) /* Bit 30: Timer D compare 4 */
#define HRTIM_TIMERST_TIMFCMP2        (1 << 31) /* Bit 0: Timer F compare 2 */

#define HRTIM_TIMFRST_TIMECMP1        (1 << 0)  /* Bit 0: Timer E compare 1 */
#define HRTIM_TIMFRST_UPDT            (1 << 1)  /* Bit 1: Timer F update reset */
#define HRTIM_TIMFRST_CMP2            (1 << 2)  /* Bit 2: Timer F compare 2 reset */
#define HRTIM_TIMFRST_CMP4            (1 << 3)  /* Bit 3: Timer F compare 4 reset */
#define HRTIM_TIMFRST_MSTPER          (1 << 4)  /* Bit 4: Master timer period */
#define HRTIM_TIMFRST_MSTCMP1         (1 << 5)  /* Bit 5: Master compare 1 */
#define HRTIM_TIMFRST_MSTCMP2         (1 << 6)  /* Bit 6: Master compare 2 */
#define HRTIM_TIMFRST_MSTCMP3         (1 << 7)  /* Bit 7: Master compare 3 */
#define HRTIM_TIMFRST_MSTCMP4         (1 << 8)  /* Bit 8: Master compare 4 */
#define HRTIM_TIMFRST_EXTEVNT1        (1 << 9)  /* Bit 9: External event 1 */
#define HRTIM_TIMFRST_EXTEVNT2        (1 << 10) /* Bit 10: External event 2 */
#define HRTIM_TIMFRST_EXTEVNT3        (1 << 11) /* Bit 11: External event 3 */
#define HRTIM_TIMFRST_EXTEVNT4        (1 << 12) /* Bit 12: External event 4 */
#define HRTIM_TIMFRST_EXTEVNT5        (1 << 13) /* Bit 13: External event 5 */
#define HRTIM_TIMFRST_EXTEVNT6        (1 << 14) /* Bit 14: External event 6 */
#define HRTIM_TIMFRST_EXTEVNT7        (1 << 15) /* Bit 15: External event 7 */
#define HRTIM_TIMFRST_EXTEVNT8        (1 << 16) /* Bit 16: External event 8 */
#define HRTIM_TIMFRST_EXTEVNT9        (1 << 17) /* Bit 17: External event 9 */
#define HRTIM_TIMFRST_EXTEVNT10       (1 << 18) /* Bit 18: External event 10 */
#define HRTIM_TIMFRST_TIMACMP1        (1 << 19) /* Bit 19: Timer A compare 1 */
#define HRTIM_TIMFRST_TIMACMP2        (1 << 20) /* Bit 20: Timer A compare 2 */
#define HRTIM_TIMFRST_TIMACMP4        (1 << 21) /* Bit 21: Timer A compare 4 */
#define HRTIM_TIMFRST_TIMBCMP1        (1 << 22) /* Bit 22: Timer B compare 1 */
#define HRTIM_TIMFRST_TIMBCMP2        (1 << 23) /* Bit 23: Timer B compare 2 */
#define HRTIM_TIMFRST_TIMBCMP4        (1 << 24) /* Bit 24: Timer B compare 4 */
#define HRTIM_TIMFRST_TIMCCMP1        (1 << 25) /* Bit 25: Timer C compare 1 */
#define HRTIM_TIMFRST_TIMCCMP2        (1 << 26) /* Bit 26: Timer C compare 2 */
#define HRTIM_TIMFRST_TIMCCMP4        (1 << 27) /* Bit 27: Timer C compare 4 */
#define HRTIM_TIMFRST_TIMDCMP1        (1 << 28) /* Bit 28: Timer D compare 1 */
#define HRTIM_TIMFRST_TIMDCMP2        (1 << 29) /* Bit 29: Timer D compare 2 */
#define HRTIM_TIMFRST_TIMDCMP4        (1 << 30) /* Bit 30: Timer D compare 4 */
#define HRTIM_TIMFRST_TIMECMP2        (1 << 31) /* Bit 0: Timer E compare 2 */

/* Timer X Chopper Register */

#define HRTIM_TIMCHP_CARFRQ_SHIFT     0 /* Bits 0-3: Chopper carrier frequency */
#define HRTIM_TIMCHP_CARFRQ_MASK      (15 << HRTIM_TIMCHP_CARFRQ_SHIFT)

#define HRTIM_TIMCHP_CARDTY_SHIFT     4 /* Bits 4-6: Chopper duty cycle */
#define HRTIM_TIMCHP_CARDTY_MASK      (7 << HRTIM_TIMCHP_CARDTY_SHIFT)

