apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g47xxx_hrtim.h
#define HRTIM_TIMDCPT12CR_SWCPT       (1 << 0)  /* Bit 0: Software capture */
#define HRTIM_TIMDCPT12CR_UPDCPT      (1 << 1)  /* Bit 1: Update capture */
#define HRTIM_TIMDCPT12CR_EXEV1CPT    (1 << 2)  /* Bit 2: External event 1 capture */
#define HRTIM_TIMDCPT12CR_EXEV2CPT    (1 << 3)  /* Bit 3: External event 2 capture */
#define HRTIM_TIMDCPT12CR_EXEV3CPT    (1 << 4)  /* Bit 4: External event 3 capture */
#define HRTIM_TIMDCPT12CR_EXEV4CPT    (1 << 5)  /* Bit 5: External event 4 capture */
#define HRTIM_TIMDCPT12CR_EXEV5CPT    (1 << 6)  /* Bit 6: External event 5 capture */
#define HRTIM_TIMDCPT12CR_EXEV6CPT    (1 << 7)  /* Bit 7: External event 6 capture */
#define HRTIM_TIMDCPT12CR_EXEV7CPT    (1 << 8)  /* Bit 8: External event 7 capture */
#define HRTIM_TIMDCPT12CR_EXEV8CPT    (1 << 9)  /* Bit 9: External event 8 capture */
#define HRTIM_TIMDCPT12CR_EXEV9CPT    (1 << 10) /* Bit 10: External event 9 capture */
#define HRTIM_TIMDCPT12CR_EXEV10CPT   (1 << 11) /* Bit 11: External event 10 capture */
#define HRTIM_TIMDCPT12CR_TA1SET      (1 << 12) /* Bit 12: Timer A output 1 set */
#define HRTIM_TIMDCPT12CR_TA1RST      (1 << 13) /* Bit 13: Timer A output 1 reset */
#define HRTIM_TIMDCPT12CR_TACMP1      (1 << 14) /* Bit 14: Timer A compare 1 */
#define HRTIM_TIMDCPT12CR_TACMP2      (1 << 15) /* Bit 15: Timer A compare 2 */
#define HRTIM_TIMDCPT12CR_TB1SET      (1 << 16) /* Bit 16: Timer B output 1 set */
#define HRTIM_TIMDCPT12CR_TB1RST      (1 << 17) /* Bit 17: Timer B output 1 reset */
#define HRTIM_TIMDCPT12CR_TBCMP1      (1 << 18) /* Bit 18: Timer B compare 1 */
#define HRTIM_TIMDCPT12CR_TBCMP2      (1 << 19) /* Bit 19: Timer B compare 2 */
#define HRTIM_TIMDCPT12CR_TC1SET      (1 << 20) /* Bit 20: Timer C output 1 set */
#define HRTIM_TIMDCPT12CR_TC1RST      (1 << 21) /* Bit 21: Timer C output 1 reset */
#define HRTIM_TIMDCPT12CR_TCCMP1      (1 << 22) /* Bit 22: Timer C compare 1 */
#define HRTIM_TIMDCPT12CR_TCCMP2      (1 << 23) /* Bit 23: Timer C compare 2 */
#define HRTIM_TIMDCPT12CR_TF1SET      (1 << 24) /* Bit 24: Timer F output 1 set */
#define HRTIM_TIMDCPT12CR_TF1RST      (1 << 25) /* Bit 25: Timer F output 1 reset */
#define HRTIM_TIMDCPT12CR_TFCMP1      (1 << 26) /* Bit 26: Timer F compare 1 */
#define HRTIM_TIMDCPT12CR_TFCMP2      (1 << 27) /* Bit 27: Timer F compare 2 */
#define HRTIM_TIMDCPT12CR_TE1SET      (1 << 28) /* Bit 28: Timer E output 1 set */
#define HRTIM_TIMDCPT12CR_TE1RST      (1 << 29) /* Bit 29: Timer E output 1 reset */
#define HRTIM_TIMDCPT12CR_TECMP1      (1 << 30) /* Bit 30: Timer E compare 1 */
#define HRTIM_TIMDCPT12CR_TECMP2      (1 << 31) /* Bit 31: Timer E compare 2 */

#define HRTIM_TIMECPT12CR_SWCPT       (1 << 0)  /* Bit 0: Software capture */
#define HRTIM_TIMECPT12CR_UPDCPT      (1 << 1)  /* Bit 1: Update capture */
#define HRTIM_TIMECPT12CR_EXEV1CPT    (1 << 2)  /* Bit 2: External event 1 capture */
#define HRTIM_TIMECPT12CR_EXEV2CPT    (1 << 3)  /* Bit 3: External event 2 capture */
#define HRTIM_TIMECPT12CR_EXEV3CPT    (1 << 4)  /* Bit 4: External event 3 capture */
#define HRTIM_TIMECPT12CR_EXEV4CPT    (1 << 5)  /* Bit 5: External event 4 capture */
#define HRTIM_TIMECPT12CR_EXEV5CPT    (1 << 6)  /* Bit 6: External event 5 capture */
#define HRTIM_TIMECPT12CR_EXEV6CPT    (1 << 7)  /* Bit 7: External event 6 capture */
#define HRTIM_TIMECPT12CR_EXEV7CPT    (1 << 8)  /* Bit 8: External event 7 capture */
#define HRTIM_TIMECPT12CR_EXEV8CPT    (1 << 9)  /* Bit 9: External event 8 capture */
#define HRTIM_TIMECPT12CR_EXEV9CPT    (1 << 10) /* Bit 10: External event 9 capture */
#define HRTIM_TIMECPT12CR_EXEV10CPT   (1 << 11) /* Bit 11: External event 10 capture */
#define HRTIM_TIMECPT12CR_TA1SET      (1 << 12) /* Bit 12: Timer A output 1 set */
#define HRTIM_TIMECPT12CR_TA1RST      (1 << 13) /* Bit 13: Timer A output 1 reset */
#define HRTIM_TIMECPT12CR_TACMP1      (1 << 14) /* Bit 14: Timer A compare 1 */
#define HRTIM_TIMECPT12CR_TACMP2      (1 << 15) /* Bit 15: Timer A compare 2 */
#define HRTIM_TIMECPT12CR_TB1SET      (1 << 16) /* Bit 16: Timer B output 1 set */
#define HRTIM_TIMECPT12CR_TB1RST      (1 << 17) /* Bit 17: Timer B output 1 reset */
#define HRTIM_TIMECPT12CR_TBCMP1      (1 << 18) /* Bit 18: Timer B compare 1 */
#define HRTIM_TIMECPT12CR_TBCMP2      (1 << 19) /* Bit 19: Timer B compare 2 */
#define HRTIM_TIMECPT12CR_TC1SET      (1 << 20) /* Bit 20: Timer C output 1 set */
#define HRTIM_TIMECPT12CR_TC1RST      (1 << 21) /* Bit 21: Timer C output 1 reset */
#define HRTIM_TIMECPT12CR_TCCMP1      (1 << 22) /* Bit 22: Timer C compare 1 */
#define HRTIM_TIMECPT12CR_TCCMP2      (1 << 23) /* Bit 23: Timer C compare 2 */
#define HRTIM_TIMECPT12CR_TD1SET      (1 << 24) /* Bit 24: Timer D output 1 set */
#define HRTIM_TIMECPT12CR_TD1RST      (1 << 25) /* Bit 25: Timer D output 1 reset */
#define HRTIM_TIMECPT12CR_TDCMP1      (1 << 26) /* Bit 26: Timer D compare 1 */
#define HRTIM_TIMECPT12CR_TDCMP2      (1 << 27) /* Bit 27: Timer D compare 2 */
#define HRTIM_TIMECPT12CR_TF1SET      (1 << 28) /* Bit 28: Timer F output 1 set */
#define HRTIM_TIMECPT12CR_TF1RST      (1 << 29) /* Bit 29: Timer F output 1 reset */
#define HRTIM_TIMECPT12CR_TFCMP1      (1 << 30) /* Bit 30: Timer F compare 1 */
#define HRTIM_TIMECPT12CR_TFCMP2      (1 << 31) /* Bit 31: Timer F compare 2 */

#define HRTIM_TIMFCPT12CR_SWCPT       (1 << 0)  /* Bit 0: Software capture */
#define HRTIM_TIMFCPT12CR_UPDCPT      (1 << 1)  /* Bit 1: Update capture */
#define HRTIM_TIMFCPT12CR_EXEV1CPT    (1 << 2)  /* Bit 2: External event 1 capture */
#define HRTIM_TIMFCPT12CR_EXEV2CPT    (1 << 3)  /* Bit 3: External event 2 capture */
#define HRTIM_TIMFCPT12CR_EXEV3CPT    (1 << 4)  /* Bit 4: External event 3 capture */
#define HRTIM_TIMFCPT12CR_EXEV4CPT    (1 << 5)  /* Bit 5: External event 4 capture */
#define HRTIM_TIMFCPT12CR_EXEV5CPT    (1 << 6)  /* Bit 6: External event 5 capture */
#define HRTIM_TIMFCPT12CR_EXEV6CPT    (1 << 7)  /* Bit 7: External event 6 capture */
#define HRTIM_TIMFCPT12CR_EXEV7CPT    (1 << 8)  /* Bit 8: External event 7 capture */
#define HRTIM_TIMFCPT12CR_EXEV8CPT    (1 << 9)  /* Bit 9: External event 8 capture */
#define HRTIM_TIMFCPT12CR_EXEV9CPT    (1 << 10) /* Bit 10: External event 9 capture */
#define HRTIM_TIMFCPT12CR_EXEV10CPT   (1 << 11) /* Bit 11: External event 10 capture */
#define HRTIM_TIMFCPT12CR_TA1SET      (1 << 12) /* Bit 12: Timer A output 1 set */
#define HRTIM_TIMFCPT12CR_TA1RST      (1 << 13) /* Bit 13: Timer A output 1 reset */
#define HRTIM_TIMFCPT12CR_TACMP1      (1 << 14) /* Bit 14: Timer A compare 1 */
#define HRTIM_TIMFCPT12CR_TACMP2      (1 << 15) /* Bit 15: Timer A compare 2 */
#define HRTIM_TIMFCPT12CR_TB1SET      (1 << 16) /* Bit 16: Timer B output 1 set */
#define HRTIM_TIMFCPT12CR_TB1RST      (1 << 17) /* Bit 17: Timer B output 1 reset */
#define HRTIM_TIMFCPT12CR_TBCMP1      (1 << 18) /* Bit 18: Timer B compare 1 */
#define HRTIM_TIMFCPT12CR_TBCMP2      (1 << 19) /* Bit 19: Timer B compare 2 */
#define HRTIM_TIMFCPT12CR_TC1SET      (1 << 20) /* Bit 20: Timer C output 1 set */
#define HRTIM_TIMFCPT12CR_TC1RST      (1 << 21) /* Bit 21: Timer C output 1 reset */
#define HRTIM_TIMFCPT12CR_TCCMP1      (1 << 22) /* Bit 22: Timer C compare 1 */
#define HRTIM_TIMFCPT12CR_TCCMP2      (1 << 23) /* Bit 23: Timer C compare 2 */
#define HRTIM_TIMFCPT12CR_TD1SET      (1 << 24) /* Bit 24: Timer D output 1 set */
#define HRTIM_TIMFCPT12CR_TD1RST      (1 << 25) /* Bit 25: Timer D output 1 reset */
#define HRTIM_TIMFCPT12CR_TDCMP1      (1 << 26) /* Bit 26: Timer D compare 1 */
#define HRTIM_TIMFCPT12CR_TDCMP2      (1 << 27) /* Bit 27: Timer D compare 2 */
#define HRTIM_TIMFCPT12CR_TE1SET      (1 << 28) /* Bit 28: Timer E output 1 set */
#define HRTIM_TIMFCPT12CR_TE1RST      (1 << 29) /* Bit 29: Timer E output 1 reset */
#define HRTIM_TIMFCPT12CR_TECMP1      (1 << 30) /* Bit 30: Timer E compare 1 */
#define HRTIM_TIMFCPT12CR_TECMP2      (1 << 31) /* Bit 31: Timer E compare 2 */

