apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g47xxx_hrtim.h
/* Timer X Output Register */

#define HRTIM_TIMOUT_POL1              (1 << 1)                         /* Bit 1: Output 1 polarity */
#define HRTIM_TIMOUT_IDLEM1            (1 << 2)                         /* Bit 2: Output 1 IDLE mode */
#define HRTIM_TIMOUT_IDLES1            (1 << 3)                         /* Bit 3: Output 1 IDLE state*/
#define HRTIM_TIMOUT_FAULT1_SHIFT      4                                /* Bit 4-5: Output 1 Fault state */
#define HRTIM_TIMOUT_FAULT1_MASK       (3 << HRTIM_TIMOUT_FAULT1_SHIFT)
#  define HRTIM_TIMOUT_FAULT1_0        (0 << HRTIM_TIMOUT_FAULT1_SHIFT) /* 00: No action */
#  define HRTIM_TIMOUT_FAULT1_1        (1 << HRTIM_TIMOUT_FAULT1_SHIFT) /* 01: Active */
#  define HRTIM_TIMOUT_FAULT1_2        (2 << HRTIM_TIMOUT_FAULT1_SHIFT) /* 10: Inactive */
#  define HRTIM_TIMOUT_FAULT1_3        (3 << HRTIM_TIMOUT_FAULT1_SHIFT) /* 11: High-Z */
#define HRTIM_TIMOUT_CHP1              (1 << 6)                         /* Bit 6: Output 1 Chopper enable */
#define HRTIM_TIMOUT_DIDL1             (1 << 7)                         /* Bit 7: Output 1 Deadtime upon burst mode IDLE entry */
#define HRTIM_TIMOUT_DTEN              (1 << 8)                         /* Bit 8: Deadtime enable */
#define HRTIM_TIMOUT_DLYPRTEN          (1 << 9)                         /* Bit 9: Delayed Protection enable */
#define HRTIM_TIMOUT_DLYPRT_SHIFT      10                               /* Bits 10-12: Delayed Protection*/
#define HRTIM_TIMOUT_DLYPRT_MASK       (3 << HRTIM_TIMOUT_DLYPRT_SHIFT)
#  define HRTIM_TIMOUT_DLYPRT_0        (0 << HRTIM_TIMOUT_DLYPRT_SHIFT) /* 000: */
#  define HRTIM_TIMOUT_DLYPRT_1        (1 << HRTIM_TIMOUT_DLYPRT_SHIFT) /* 001: */
#  define HRTIM_TIMOUT_DLYPRT_2        (2 << HRTIM_TIMOUT_DLYPRT_SHIFT) /* 010: */
#  define HRTIM_TIMOUT_DLYPRT_3        (3 << HRTIM_TIMOUT_DLYPRT_SHIFT) /* 011: */
#  define HRTIM_TIMOUT_DLYPRT_4        (4 << HRTIM_TIMOUT_DLYPRT_SHIFT) /* 100: */
#  define HRTIM_TIMOUT_DLYPRT_5        (5 << HRTIM_TIMOUT_DLYPRT_SHIFT) /* 101: */
#  define HRTIM_TIMOUT_DLYPRT_6        (6 << HRTIM_TIMOUT_DLYPRT_SHIFT) /* 110: */
#  define HRTIM_TIMOUT_DLYPRT_7        (7 << HRTIM_TIMOUT_DLYPRT_SHIFT) /* 111: */
                                                                        /* Bit 12-16: Resered  */
#define HRTIM_TIMOUT_POL2             (1 << 17)                         /* Bit 17: Output 2 polarity */
#define HRTIM_TIMOUT_IDLEM2           (1 << 18)                         /* Bit 18: Output 2 IDLE mode */
#define HRTIM_TIMOUT_IDLES2           (1 << 19)                         /* Bit 19: Output 2 IDLE state */
#define HRTIM_TIMOUT_FAULT2_SHIFT     20                                /* Bit 20-21: Output 2 Fault state */
#define HRTIM_TIMOUT_FAULT2_MASK      (3 << HRTIM_TIMOUT_FAULT2_SHIFT)
#  define HRTIM_TIMOUT_FAULT2_0       (0 << HRTIM_TIMOUT_FAULT2_SHIFT)  /* 00: No action*/
#  define HRTIM_TIMOUT_FAULT2_1       (1 << HRTIM_TIMOUT_FAULT2_SHIFT)  /* 01: Active */
#  define HRTIM_TIMOUT_FAULT2_2       (2 << HRTIM_TIMOUT_FAULT2_SHIFT)  /* 10: Inactive */
#  define HRTIM_TIMOUT_FAULT2_3       (3 << HRTIM_TIMOUT_FAULT2_SHIFT)  /* 11: High-Z*/
#define HRTIM_TIMOUT_CHP2             (1 << 22)                         /* Bit 22: Output 2 Chopper enable */
#define HRTIM_TIMOUT_DIDL2            (1 << 23)                         /* Bit 23: Output 2 Deadtime upon burst mode IDLE entry */

/* Timer X Fault Register */

#define HRTIM_TIMFLT_FLT1EN           (1 << 0)  /* Bit 0: Fault1 enable */
#define HRTIM_TIMFLT_FLT2EN           (1 << 1)  /* Bit 1: Fault 2 enable */
#define HRTIM_TIMFLT_FLT3EN           (1 << 2)  /* Bit 2: Fault 3 enable*/
#define HRTIM_TIMFLT_FLT4EN           (1 << 3)  /* Bit 3: Fault 4 enable */
#define HRTIM_TIMFLT_FLT5EN           (1 << 4)  /* Bit 4: Fault 5 enable */
#define HRTIM_TIMFLT_FLT6EN           (1 << 5)  /* Bit 5: Fault 6 enable */
#define HRTIM_TIMFLT_FLTLCK           (1 << 31) /* Bit 31: Fault sources lock*/

/* Timer X Control Register 2 */

#define HRTIM_TIMCR2_DCDE             (1 << 0)  /* Bit 0: Dual channel DAC trigger enable */
#define HRTIM_TIMCR2_DCDS             (1 << 1)  /* Bit 1: Dual channel DAC Step trigger */
#define HRTIM_TIMCR2_DCDR             (1 << 2)  /* Bit 2: Dual channel DAC reset trigger */
#define HRTIM_TIMCR2_UDM              (1 << 4)  /* Bit 4: Up-Down mode */
#define HRTIM_TIMCR2_ROM_SHIFT        6         /* Bits 6-7: Roll-over mode */
#define HRTIM_TIMCR2_ROM_MASK         (3 << HRTIM_TIMCR2_ROM_SHIFT)
#  define HRTIM_TIMCR2_ROM_00         (0 << HRTIM_TIMCR2_ROM_SHIFT)  /* 00: */
#  define HRTIM_TIMCR2_ROM_01         (1 << HRTIM_TIMCR2_ROM_SHIFT)  /* 01: */
#  define HRTIM_TIMCR2_ROM_10         (2 << HRTIM_TIMCR2_ROM_SHIFT)  /* 10: */
#define HRTIM_TIMCR2_OUTROM_SHIFT     8                              /* Bits 8-9: Output roll-over mode */
#define HRTIM_TIMCR2_OUTROM_MASK      (3 << HRTIM_TIMCR2_OUTROM_SHIFT)
#  define HRTIM_TIMCR2_OUTROM_00      (0 << HRTIM_TIMCR2_OUTROM_SHIFT)  /* 00: */
#  define HRTIM_TIMCR2_OUTROM_01      (1 << HRTIM_TIMCR2_OUTROM_SHIFT)  /* 01: */
#  define HRTIM_TIMCR2_OUTROM_10      (2 << HRTIM_TIMCR2_OUTROM_SHIFT)  /* 10: */
#define HRTIM_TIMCR2_ADROM_SHIFT      10                                /* Bits 10-11: ADC roll-over mode */
#define HRTIM_TIMCR2_ADROM_MASK       (3 << HRTIM_TIMCR2_ADROM_SHIFT)
#  define HRTIM_TIMCR2_ADROM_00       (0 << HRTIM_TIMCR2_ADROM_SHIFT)  /* 00: */
#  define HRTIM_TIMCR2_ADROM_01       (1 << HRTIM_TIMCR2_ADROM_SHIFT)  /* 01: */
#  define HRTIM_TIMCR2_ADROM_10       (2 << HRTIM_TIMCR2_ADROM_SHIFT)  /* 10: */
#define HRTIM_TIMCR2_BMROM_SHIFT      12                               /* Bits 12-13: Burst mode roll-over mode */
#define HRTIM_TIMCR2_BMROM_MASK       (3 << HRTIM_TIMCR2_BMROM_SHIFT)
#  define HRTIM_TIMCR2_BMROM_00       (0 << HRTIM_TIMCR2_BMROM_SHIFT)  /* 00: */
#  define HRTIM_TIMCR2_BMROM_01       (1 << HRTIM_TIMCR2_BMROM_SHIFT)  /* 01: */
#  define HRTIM_TIMCR2_BMROM_10       (2 << HRTIM_TIMCR2_BMROM_SHIFT)  /* 10: */
#define HRTIM_TIMCR2_FEROM_SHIFT      14                               /* Bits 14-15: Fault and event roll-over mode */
#define HRTIM_TIMCR2_FEROM_MASK       (3 << HRTIM_TIMCR2_FEROM_SHIFT)
#  define HRTIM_TIMCR2_FEROM_00       (0 << HRTIM_TIMCR2_FEROM_SHIFT)  /* 00: */
#  define HRTIM_TIMCR2_FEROM_01       (1 << HRTIM_TIMCR2_FEROM_SHIFT)  /* 01: */
#  define HRTIM_TIMCR2_FEROM_10       (2 << HRTIM_TIMCR2_FEROM_SHIFT)  /* 10: */
#define HRTIM_TIMCR2_GTCMP1           (1 << 16)                        /* Bit 16: Greater than compare 1 PWM mode */
#define HRTIM_TIMCR2_GTCMP3           (1 << 17)                        /* Bit 17: Greater than compare 3 PWM mode */
#define HRTIM_TIMCR2_TRGHLF           (1 << 20)                        /* Bit 20: Triggered-half mode */

/* Timer X external event filtering register 3 */

#define HRTIM_TIMEEFR3_EEVACE         (1 << 0)                             /* Bit 0: External event A counter enable */
#define HRTIM_TIMEEFR3_EEVARSTM       (1 << 1)                             /* Bit 1: External event A counter reset */
#define HRTIM_TIMEEFR3_EEVACRES       (1 << 2)                             /* Bit 2: External event A reset mode */
#define HRTIM_TIMEEFR3_EEVASEL_SHIFT  4                                    /* Bits 4-7: External event A Selection */
#define HRTIM_TIMEEFR3_EEVASEL_MASK   (0xf << HRTIM_TIMEEFR3_EEVASEL_SHIFT)
#  define HRTIM_TIMEEFR3_EEVASEL_1    (0 << HRTIM_TIMEEFR3_EEVASEL_SHIFT)  /* External event 1 is used as external event A source */
#  define HRTIM_TIMEEFR3_EEVASEL_2    (1 << HRTIM_TIMEEFR3_EEVASEL_SHIFT)  /* External event 2 is used as external event A source */
#  define HRTIM_TIMEEFR3_EEVASEL_3    (2 << HRTIM_TIMEEFR3_EEVASEL_SHIFT)  /* External event 3 is used as external event A source */
#  define HRTIM_TIMEEFR3_EEVASEL_4    (3 << HRTIM_TIMEEFR3_EEVASEL_SHIFT)  /* External event 4 is used as external event A source */
#  define HRTIM_TIMEEFR3_EEVASEL_5    (4 << HRTIM_TIMEEFR3_EEVASEL_SHIFT)  /* External event 5 is used as external event A source */
#  define HRTIM_TIMEEFR3_EEVASEL_6    (5 << HRTIM_TIMEEFR3_EEVASEL_SHIFT)  /* External event 6 is used as external event A source */
#  define HRTIM_TIMEEFR3_EEVASEL_7    (6 << HRTIM_TIMEEFR3_EEVASEL_SHIFT)  /* External event 7 is used as external event A source */
#  define HRTIM_TIMEEFR3_EEVASEL_8    (7 << HRTIM_TIMEEFR3_EEVASEL_SHIFT)  /* External event 8 is used as external event A source */
#  define HRTIM_TIMEEFR3_EEVASEL_9    (8 << HRTIM_TIMEEFR3_EEVASEL_SHIFT)  /* External event 9 is used as external event A source */
#  define HRTIM_TIMEEFR3_EEVASEL_10   (9 << HRTIM_TIMEEFR3_EEVASEL_SHIFT)  /* External event 10 is used as external event A source */
#define HRTIM_TIMEEFR3_EEVACNT_SHIFT  8                                    /* Bits 8-13: External event A counter */
#define HRTIM_TIMEEFR3_EEVACNT_MASK   (0x3f << HRTIM_TIMEEFR3_EEVACNT_SHIFT)

/* Common Control Register 1 */

#define HRTIM_CR1_MUDIS               (1 << 0) /* Bit 0: Master Update Disable */
#define HRTIM_CR1_TAUDIS              (1 << 1) /* Bit 1: Timer A Update Disable */
#define HRTIM_CR1_TBUDIS              (1 << 2) /* Bit 2: Timer B Update Disable */
#define HRTIM_CR1_TCUDIS              (1 << 3) /* Bit 3: Timer C Update Disable */
#define HRTIM_CR1_TDUDIS              (1 << 4) /* Bit 4: Timer D Update Disable */
#define HRTIM_CR1_TEUDIS              (1 << 5) /* Bit 5: Timer E Update Disable */
#define HRTIM_CR1_TFUDIS              (1 << 6) /* Bit 6: Timer F Update Disable */
#define HRTIM_CR1_AD1USRC_SHIFT       16       /* Bits 16-18: ADC Trigger 1 Update Source  */
#define HRTIM_CR1_AD1USRC_MASK        (7 << HRTIM_CR1_AD1USRC_SHIFT)
#  define HRTIM_CR1_AD1USRC_MT        (0 << HRTIM_CR1_AD1USRC_SHIFT) /* 000: Master Timer */
#  define HRTIM_CR1_AD1USRC_TA        (1 << HRTIM_CR1_AD1USRC_SHIFT) /* 001: Timer A */
#  define HRTIM_CR1_AD1USRC_TB        (2 << HRTIM_CR1_AD1USRC_SHIFT) /* 010: Timer B */
#  define HRTIM_CR1_AD1USRC_TC        (3 << HRTIM_CR1_AD1USRC_SHIFT) /* 011: Timer C */
#  define HRTIM_CR1_AD1USRC_TD        (4 << HRTIM_CR1_AD1USRC_SHIFT) /* 100: Timer D */
#  define HRTIM_CR1_AD1USRC_TE        (5 << HRTIM_CR1_AD1USRC_SHIFT) /* 101: Timer E */
#  define HRTIM_CR1_AD1USRC_TF        (6 << HRTIM_CR1_AD1USRC_SHIFT) /* 110: Timer F */
#define HRTIM_CR1_AD2USRC_SHIFT       19                             /* Bits 19-21: ADC Trigger 2 Update Source  */
#define HRTIM_CR1_AD2USRC_MASK        (7 << HRTIM_CR1_AD2USRC_SHIFT)
#  define HRTIM_CR1_AD2USRC_MT        (0 << HRTIM_CR1_AD2USRC_SHIFT) /* 000: Master Timer */
#  define HRTIM_CR1_AD2USRC_TA        (1 << HRTIM_CR1_AD2USRC_SHIFT) /* 001: Timer A */
#  define HRTIM_CR1_AD2USRC_TB        (2 << HRTIM_CR1_AD2USRC_SHIFT) /* 010: Timer B */
#  define HRTIM_CR1_AD2USRC_TC        (3 << HRTIM_CR1_AD2USRC_SHIFT) /* 011: Timer C */
#  define HRTIM_CR1_AD2USRC_TD        (4 << HRTIM_CR1_AD2USRC_SHIFT) /* 100: Timer D */
#  define HRTIM_CR1_AD2USRC_TE        (5 << HRTIM_CR1_AD2USRC_SHIFT) /* 101: Timer E */
#  define HRTIM_CR1_AD2USRC_TF        (6 << HRTIM_CR1_AD2USRC_SHIFT) /* 110: Timer F */
#define HRTIM_CR1_AD3USRC_SHIFT       22                             /* Bits 22-24: ADC Trigger 3 Update Source  */
#define HRTIM_CR1_AD3USRC_MASK        (7 << HRTIM_CR1_AD3USRC_SHIFT)
#  define HRTIM_CR1_AD3USRC_MT        (0 << HRTIM_CR1_AD3USRC_SHIFT) /* 000: Master Timer */
#  define HRTIM_CR1_AD3USRC_TA        (1 << HRTIM_CR1_AD3USRC_SHIFT) /* 001: Timer A */
#  define HRTIM_CR1_AD3USRC_TB        (2 << HRTIM_CR1_AD3USRC_SHIFT) /* 010: Timer B */
#  define HRTIM_CR1_AD3USRC_TC        (3 << HRTIM_CR1_AD3USRC_SHIFT) /* 011: Timer C */
#  define HRTIM_CR1_AD3USRC_TD        (4 << HRTIM_CR1_AD3USRC_SHIFT) /* 100: Timer D */
#  define HRTIM_CR1_AD3USRC_TE        (5 << HRTIM_CR1_AD3USRC_SHIFT) /* 101: Timer E */
#  define HRTIM_CR1_AD3USRC_TF        (6 << HRTIM_CR1_AD3USRC_SHIFT) /* 110: Timer F */
#define HRTIM_CR1_AD4USRC_SHIFT       25                             /* Bits 25-27: ADC Trigger 4 Update Source  */
#define HRTIM_CR1_AD4USRC_MASK        (7 << HRTIM_CR1_AD4USRC_SHIFT)
#  define HRTIM_CR1_AD4USRC_MT        (0 << HRTIM_CR1_AD4USRC_SHIFT) /* 000: Master Timer */
#  define HRTIM_CR1_AD4USRC_TA        (1 << HRTIM_CR1_AD4USRC_SHIFT) /* 001: Timer A */
#  define HRTIM_CR1_AD4USRC_TB        (2 << HRTIM_CR1_AD4USRC_SHIFT) /* 010: Timer B */
#  define HRTIM_CR1_AD4USRC_TC        (3 << HRTIM_CR1_AD4USRC_SHIFT) /* 011: Timer C */
#  define HRTIM_CR1_AD4USRC_TD        (4 << HRTIM_CR1_AD4USRC_SHIFT) /* 100: Timer D */
#  define HRTIM_CR1_AD4USRC_TE        (5 << HRTIM_CR1_AD4USRC_SHIFT) /* 101: Timer E */
#  define HRTIM_CR1_AD4USRC_TF        (6 << HRTIM_CR1_AD4USRC_SHIFT) /* 110: Timer F */

/* Common Control Register 2 */

#define HRTIM_CR2_MSWU                (1 << 0)  /* Bit 0: Master Timer Software Update */
#define HRTIM_CR2_TASWU               (1 << 1)  /* Bit 1: Timer A Software Update */
#define HRTIM_CR2_TBSWU               (1 << 2)  /* Bit 2: Timer B Software Update */
#define HRTIM_CR2_TCSWU               (1 << 3)  /* Bit 3: Timer C Software Update */
#define HRTIM_CR2_TDSWU               (1 << 4)  /* Bit 4: Timer D Software Update */
#define HRTIM_CR2_TESWU               (1 << 5)  /* Bit 5: Timer E Software Update */
#define HRTIM_CR2_TFSWU               (1 << 6)  /* Bit 6: Timer F Software Update */
#define HRTIM_CR2_MRST                (1 << 8)  /* Bit 8: Master Counter Software Reset */
#define HRTIM_CR2_TARST               (1 << 9)  /* Bit 9: Timer A Counter Software Reset */
#define HRTIM_CR2_TBRST               (1 << 10) /* Bit 10: Timer B Counter Software Reset */
#define HRTIM_CR2_TCRST               (1 << 11) /* Bit 11: Timer C Counter Software Reset */
#define HRTIM_CR2_TDRST               (1 << 12) /* Bit 12: Timer D Counter Software Reset */
#define HRTIM_CR2_TERST               (1 << 13) /* Bit 13: Timer E Counter Software Reset */
#define HRTIM_CR2_TFRST               (1 << 14) /* Bit 14: Timer F Counter Software Reset */
#define HRTIM_CR2_SWPA                (1 << 16) /* Bit 16: Swap timer A outputs */
#define HRTIM_CR2_SWPB                (1 << 17) /* Bit 17: Swap timer B outputs */
#define HRTIM_CR2_SWPC                (1 << 18) /* Bit 18: Swap timer C outputs */
#define HRTIM_CR2_SWPD                (1 << 19) /* Bit 19: Swap timer D outputs */
#define HRTIM_CR2_SWPE                (1 << 20) /* Bit 20: Swap timer E outputs */
#define HRTIM_CR2_SWPF                (1 << 21) /* Bit 21: Swap timer F outputs */

