apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g47xxx_hrtim.h
#define HRTIM_BMPER_SHIFT              0          /* Bits 0-15: Burst mode Period */
#define HRTIM_BMPER_MASK               (0xffff << HRTIM_BMPER_SHIFT)

/* Common External Event Control Register 1 */

#define HRTIM_EECR1_EE1SRC_SHIFT      0                               /* Bits 0-1: External Event 1 Source */
#define HRTIM_EECR1_EE1SRC_MASK       (3 << HRTIM_EECR1_EE1SRC_SHIFT)
#  define HRTIM_EECR1_EE1SRC_SRC1     (0 << HRTIM_EECR1_EE1SRC_SHIFT) /* 00: EE1 Src1 */
#  define HRTIM_EECR1_EE1SRC_SRC2     (1 << HRTIM_EECR1_EE1SRC_SHIFT) /* 00: EE1 Src2 */
#  define HRTIM_EECR1_EE1SRC_SRC3     (2 << HRTIM_EECR1_EE1SRC_SHIFT) /* 00: EE1 Src3 */
#  define HRTIM_EECR1_EE1SRC_SRC4     (3 << HRTIM_EECR1_EE1SRC_SHIFT) /* 00: EE1 Src4 */
#define HRTIM_EECR1_EE1POL            (1 << 2)                        /* Bit 2: External Event 1 Polarity */
#define HRTIM_EECR1_EE1SNS_SHIFT      3                               /* Bits 3-4: External Event 1 Sensitivity */
#define HRTIM_EECR1_EE1SNS_MASK       (3 << HRTIM_EECR1_EE1SNS_SHIFT)
#  define HRTIM_EECR1_EE1SNS_ACTIV    (0 << HRTIM_EECR1_EE1SNS_SHIFT) /* 00: On active level defined by EE1POL bit */
#  define HRTIM_EECR1_EE1SNS_REDGE    (1 << HRTIM_EECR1_EE1SNS_SHIFT) /* 01: Rising edge, whatever EE1POL bit value */
#  define HRTIM_EECR1_EE1SNS_FEDGE    (2 << HRTIM_EECR1_EE1SNS_SHIFT) /* 10: Falling edge, whatever EE1POL bit value */
#  define HRTIM_EECR1_EE1SNS_BEDGE    (3 << HRTIM_EECR1_EE1SNS_SHIFT) /* 11: Both edges, whatever EE1POL bit value */
#define HRTIM_EECR1_EE1FAST           (1 << 5)                        /* Bit 5: External Event 1 Fast mode */
#define HRTIM_EECR1_EE2SRC_SHIFT      6                               /* Bits 6-7: External Event 2 Source */
#define HRTIM_EECR1_EE2SRC_MASK       (3 << HRTIM_EECR1_EE2SRC_SHIFT)
#  define HRTIM_EECR1_EE2SRC_SRC1     (0 << HRTIM_EECR1_EE2SRC_SHIFT) /* 00: EE2 Src1 */
#  define HRTIM_EECR1_EE2SRC_SRC2     1 << HRTIM_EECR1_EE2SRC_SHIFT)  /* 00: EE2 Src2 */
#  define HRTIM_EECR1_EE2SRC_SRC3     (2 << HRTIM_EECR1_EE2SRC_SHIFT) /* 00: EE2 Src3 */
#  define HRTIM_EECR1_EE2SRC_SRC4     (3 << HRTIM_EECR1_EE2SRC_SHIFT) /* 00: EE2 Src4 */
#define HRTIM_EECR1_EE2POL            (1 << 8)                        /* Bit 8: External Event 2 Polarity */
#define HRTIM_EECR1_EE2SNS_SHIFT      9                               /* Bits 9-10: External Event 2 Sensitivity */
#define HRTIM_EECR1_EE2SNS_MASK       (3 << HRTIM_EECR1_EE2SNS_SHIFT)
#  define HRTIM_EECR1_EE2SNS_ACTIV    (0 << HRTIM_EECR1_EE2SNS_SHIFT) /* 00: On active level defined by EE2POL bit */
#  define HRTIM_EECR1_EE2SNS_REDGE    (1 << HRTIM_EECR1_EE2SNS_SHIFT) /* 01: Rising edge, whatever EE2POL bit value */
#  define HRTIM_EECR1_EE2SNS_FEDGE    (2 << HRTIM_EECR1_EE2SNS_SHIFT) /* 10: Falling edge, whatever EE2POL bit value */
#  define HRTIM_EECR1_EE2SNS_BEDGE    (3 << HRTIM_EECR1_EE2SNS_SHIFT) /* 11: Both edges, whatever EE2POL bit value */
#define HRTIM_EECR1_EE2FAST           (1 << 11)                       /* Bit 11: External Event 2 Fast mode */
#define HRTIM_EECR1_EE3SRC_SHIFT      12                              /* Bits 12-13: External Event 3 Source */
#define HRTIM_EECR1_EE3SRC_MASK       (3 << HRTIM_EECR1_EE3SRC_SHIFT)
#  define HRTIM_EECR1_EE3SRC_SRC1     (0 << HRTIM_EECR1_EE3SRC_SHIFT) /* 00: EE3 Src1 */
#  define HRTIM_EECR1_EE3SRC_SRC2     (1 << HRTIM_EECR1_EE3SRC_SHIFT) /* 00: EE3 Src2 */
#  define HRTIM_EECR1_EE3SRC_SRC3     (2 << HRTIM_EECR1_EE3SRC_SHIFT) /* 00: EE3 Src3 */
#  define HRTIM_EECR1_EE3SRC_SRC4     (3 << HRTIM_EECR1_EE3SRC_SHIFT) /* 00: EE3 Src4 */
#define HRTIM_EECR1_EE3POL            (1 << 14)                       /* Bit 14: External Event 3 Polarity */
#define HRTIM_EECR1_EE3SNS_SHIFT      15                              /* Bits 15-16: External Event 3 Sensitivity */
#define HRTIM_EECR1_EE3SNS_MASK       (3 << HRTIM_EECR1_EE3SNS_SHIFT)
#  define HRTIM_EECR1_EE3SNS_ACTIV    (0 << HRTIM_EECR1_EE3SNS_SHIFT) /* 00: On active level defined by EE3POL bit */
#  define HRTIM_EECR1_EE3SNS_REDGE    (1 << HRTIM_EECR1_EE3SNS_SHIFT) /* 01: Rising edge, whatever EE3POL bit value */
#  define HRTIM_EECR1_EE3SNS_FEDGE    (2 << HRTIM_EECR1_EE3SNS_SHIFT) /* 10: Falling edge, whatever EE3POL bit value */
#  define HRTIM_EECR1_EE3SNS_BEDGE    (3 << HRTIM_EECR1_EE3SNS_SHIFT) /* 11: Both edges, whatever EE3POL bit value */
#define HRTIM_EECR1_EE3FAST           (1 << 17)                       /* Bit 17: External Event 3 Fast mode */
#define HRTIM_EECR1_EE4SRC_SHIFT      18                              /* Bits 18-19: External Event 4 Source */
#define HRTIM_EECR1_EE4SRC_MASK       (3 << HRTIM_EECR1_EE4SRC_SHIFT)
#  define HRTIM_EECR1_EE4SRC_SRC1     (0 << HRTIM_EECR1_EE4SRC_SHIFT) /* 00: EE4 Src1 */
#  define HRTIM_EECR1_EE4SRC_SRC2     (1 << HRTIM_EECR1_EE4SRC_SHIFT) /* 00: EE4 Src2 */
#  define HRTIM_EECR1_EE4SRC_SRC3     (2 << HRTIM_EECR1_EE4SRC_SHIFT) /* 00: EE4 Src3 */
#  define HRTIM_EECR1_EE4SRC_SRC4     (3 << HRTIM_EECR1_EE4SRC_SHIFT) /* 00: EE4 Src4 */
#define HRTIM_EECR1_EE4POL            (1 << 20)                       /* Bit 20: External Event 4 Polarity */
#define HRTIM_EECR1_EE4SNS_SHIFT      21                              /* Bits 21-22: External Event 4 Sensitivity */
#define HRTIM_EECR1_EE4SNS_MASK       (3 << HRTIM_EECR1_EE4SNS_SHIFT)
#  define HRTIM_EECR1_EE4SNS_ACTIV    (0 << HRTIM_EECR1_EE4SNS_SHIFT) /* 00: On active level defined by EE4POL bit */
#  define HRTIM_EECR1_EE4SNS_REDGE    (1 << HRTIM_EECR1_EE4SNS_SHIFT) /* 01: Rising edge, whatever EE4POL bit value */
#  define HRTIM_EECR1_EE4SNS_FEDGE    (2 << HRTIM_EECR1_EE4SNS_SHIFT) /* 10: Falling edge, whatever EE4POL bit value */
#  define HRTIM_EECR1_EE4SNS_BEDGE    (3 << HRTIM_EECR1_EE4SNS_SHIFT) /* 11: Both edges, whatever EE4POL bit value */
#define HRTIM_EECR1_EE4FAST           (1 << 23)                       /* Bit 23: External Event 4 Fast mode */
#define HRTIM_EECR1_EE5SRC_SHIFT      24                              /* Bits 24-25: External Event 5 Source */
#define HRTIM_EECR1_EE5SRC_MASK       (3 << HRTIM_EECR1_EE5SRC_SHIFT)
#  define HRTIM_EECR1_EE5SRC_SRC1     (0 << HRTIM_EECR1_EE5SRC_SHIFT) /* 00: EE5 Src1 */
#  define HRTIM_EECR1_EE5SRC_SRC2     (1 << HRTIM_EECR1_EE5SRC_SHIFT) /* 00: EE5 Src2 */
#  define HRTIM_EECR1_EE5SRC_SRC3     (2 << HRTIM_EECR1_EE5SRC_SHIFT) /* 00: EE5 Src3 */
#  define HRTIM_EECR1_EE5SRC_SRC4     (3 << HRTIM_EECR1_EE5SRC_SHIFT) /* 00: EE5 Src4 */
#define HRTIM_EECR1_EE5POL            (1 << 26)                       /* Bit 26: External Event 5 Polarity */
#define HRTIM_EECR1_EE5SNS_SHIFT      27                              /* Bits 27-28: External Event 5 Sensitivity */
#define HRTIM_EECR1_EE5SNS_MASK       (3 << HRTIM_EECR1_EE5SNS_SHIFT)
#  define HRTIM_EECR1_EE5SNS_ACTIV    (0 << HRTIM_EECR1_EE5SNS_SHIFT) /* 00: On active level defined by EE5POL bit */
#  define HRTIM_EECR1_EE5SNS_REDGE    (1 << HRTIM_EECR1_EE5SNS_SHIFT) /* 01: Rising edge, whatever EE5POL bit value */
#  define HRTIM_EECR1_EE5SNS_FEDGE    (2 << HRTIM_EECR1_EE5SNS_SHIFT) /* 10: Falling edge, whatever EE5POL bit value */
#  define HRTIM_EECR1_EE5SNS_BEDGE    (3 << HRTIM_EECR1_EE5SNS_SHIFT) /* 11: Both edges, whatever EE5POL bit value */
#define HRTIM_EECR1_EE5FAST           (1 << 29)                       /* Bit 29: External Event 5 Fast mode */

/* Common External Event Control Register 2 */

#define HRTIM_EECR2_EE6SRC_SHIFT        0                               /* Bits 0-1: External Event 6 Source */
#define HRTIM_EECR2_EE6SRC_MASK         (3 << HRTIM_EECR2_EE6SRC_SHIFT)
#  define HRTIM_EECR2_EE6SRC_SRC1       (0 << HRTIM_EECR2_EE6SRC_SHIFT) /* 00: EE6 Src1 */
#  define HRTIM_EECR2_EE6SRC_SRC2       (1 << HRTIM_EECR2_EE6SRC_SHIFT) /* 00: EE6 Src2 */
#  define HRTIM_EECR2_EE6SRC_SRC3       (2 << HRTIM_EECR2_EE6SRC_SHIFT) /* 00: EE6 Src3 */
#  define HRTIM_EECR2_EE6SRC_SRC4       (3 << HRTIM_EECR2_EE6SRC_SHIFT) /* 00: EE6 Src4 */
#define HRTIM_EECR2_EE6POL              (1 << 3)                        /* Bit 2: External Event 6 Polarity */
#define HRTIM_EECR2_EE6SNS_SHIFT        3                               /* Bits 3-4: External Event 6 Sensitivity */
#define HRTIM_EECR2_EE6SNS_MASK         (3 << HRTIM_EECR2_EE6SNS_SHIFT)
#  define HRTIM_EECR2_EE6SNS_ACTIV      (0 << HRTIM_EECR2_EE6SNS_SHIFT) /* 00: On active level defined by EE6POL bit */
#  define HRTIM_EECR2_EE6SNS_REDGE      (1 << HRTIM_EECR2_EE6SNS_SHIFT) /* 01: Rising edge, whatever EE6POL bit value */
#  define HRTIM_EECR2_EE6SNS_FEDGE      (2 << HRTIM_EECR2_EE6SNS_SHIFT) /* 10: Falling edge, whatever EE6POL bit value */
#  define HRTIM_EECR2_EE6SNS_BEDGE      (3 << HRTIM_EECR2_EE6SNS_SHIFT) /* 11: Both edges, whatever EE6POL bit value */
#define HRTIM_EECR2_EE7SRC_SHIFT        6                               /* Bits 6-7: External Event 7 Source */
#define HRTIM_EECR2_EE7SRC_MASK         (3 << HRTIM_EECR2_EE7SRC_SHIFT)
#  define HRTIM_EECR2_EE7SRC_SRC1       (0 << HRTIM_EECR2_EE7SRC_SHIFT) /* 00: EE7 Src1 */
#  define HRTIM_EECR2_EE7SRC_SRC2       (1 << HRTIM_EECR2_EE7SRC_SHIFT) /* 00: EE7 Src2 */
#  define HRTIM_EECR2_EE7SRC_SRC3       (2 << HRTIM_EECR2_EE7SRC_SHIFT) /* 00: EE7 Src3 */
#  define HRTIM_EECR2_EE7SRC_SRC4       (3 << HRTIM_EECR2_EE7SRC_SHIFT) /* 00: EE7 Src4 */
#define HRTIM_EECR2_EE7POL              (1 << 8)                        /* Bit 8: External Event 7 Polarity */
#define HRTIM_EECR2_EE7SNS_SHIFT        9                               /* Bits 9-10: External Event 7 Sensitivity */
#define HRTIM_EECR2_EE7SNS_MASK         (3 << HRTIM_EECR2_EE7SNS_SHIFT)
#  define HRTIM_EECR2_EE7SNS_ACTIV      (0 << HRTIM_EECR2_EE7SNS_SHIFT) /* 00: On active level defined by EE7POL bit */
#  define HRTIM_EECR2_EE7SNS_REDGE      (1 << HRTIM_EECR2_EE7SNS_SHIFT) /* 01: Rising edge, whatever EE7POL bit value */
#  define HRTIM_EECR2_EE7SNS_FEDGE      (2 << HRTIM_EECR2_EE7SNS_SHIFT) /* 10: Falling edge, whatever EE7POL bit value */
#  define HRTIM_EECR2_EE7SNS_BEDGE      (3 << HRTIM_EECR2_EE7SNS_SHIFT) /* 11: Both edges, whatever EE7POL bit value */
#define HRTIM_EECR2_EE8SRC_SHIFT        12                              /* Bits 12-13: External Event 8 Source */
#define HRTIM_EECR2_EE8SRC_MASK         (3 << HRTIM_EECR2_EE8SRC_SHIFT)
#  define HRTIM_EECR2_EE8SRC_SRC1       (0 << HRTIM_EECR2_EE8SRC_SHIFT) /* 00: EE8 Src1 */
#  define HRTIM_EECR2_EE8SRC_SRC2       (1 << HRTIM_EECR2_EE8SRC_SHIFT) /* 00: EE8 Src2 */
#  define HRTIM_EECR2_EE8SRC_SRC3       (2 << HRTIM_EECR2_EE8SRC_SHIFT) /* 00: EE8 Src3 */
#  define HRTIM_EECR2_EE8SRC_SRC4       (3 << HRTIM_EECR2_EE8SRC_SHIFT) /* 00: EE8 Src4 */
#define HRTIM_EECR2_EE8POL              (1 << 14)                       /* Bit 14: External Event 8 Polarity */
#define HRTIM_EECR2_EE8SNS_SHIFT        15                              /* Bits 15-16: External Event 8 Sensitivity */
#define HRTIM_EECR2_EE8SNS_MASK         (3 << HRTIM_EECR2_EE8SNS_SHIFT)
#  define HRTIM_EECR2_EE8SNS_ACTIV      (0 << HRTIM_EECR2_EE8SNS_SHIFT) /* 00: On active level defined by EE8POL bit */
#  define HRTIM_EECR2_EE8SNS_REDGE      (1 << HRTIM_EECR2_EE8SNS_SHIFT) /* 01: Rising edge, whatever EE8POL bit value */
#  define HRTIM_EECR2_EE8SNS_FEDGE      (2 << HRTIM_EECR2_EE8SNS_SHIFT) /* 10: Falling edge, whatever EE8POL bit value */
#  define HRTIM_EECR2_EE8SNS_BEDGE      (3 << HRTIM_EECR2_EE8SNS_SHIFT) /* 11: Both edges, whatever EE8POL bit value */
#define HRTIM_EECR2_EE9SRC_SHIFT        18                              /* Bits 18-19: External Event 9 Source */
#define HRTIM_EECR2_EE9SRC_MASK         (3 << HRTIM_EECR2_EE9SRC_SHIFT)
#  define HRTIM_EECR2_EE9SRC_SRC1       (0 << HRTIM_EECR2_EE9SRC_SHIFT) /* 00: EE9 Src1 */
#  define HRTIM_EECR2_EE9SRC_SRC2       (1 << HRTIM_EECR2_EE9SRC_SHIFT) /* 00: EE9 Src2 */
#  define HRTIM_EECR2_EE9SRC_SRC3       (2 << HRTIM_EECR2_EE9SRC_SHIFT) /* 00: EE9 Src3 */
#  define HRTIM_EECR2_EE9SRC_SRC4       (3 << HRTIM_EECR2_EE9SRC_SHIFT) /* 00: EE9 Src4 */
#define HRTIM_EECR2_EE9POL              (1 << 20)                       /* Bit 20: External Event 9 Polarity */
#define HRTIM_EECR2_EE9SNS_SHIFT        21                              /* Bits 21-22: External Event 9 Sensitivity */
#define HRTIM_EECR2_EE9SNS_MASK         (3 << HRTIM_EECR2_EE9SNS_SHIFT)
#  define HRTIM_EECR2_EE9SNS_ACTIV      (0 << HRTIM_EECR2_EE9SNS_SHIFT) /* 00: On active level defined by EE9POL bit */
#  define HRTIM_EECR2_EE9SNS_REDGE      (1 << HRTIM_EECR2_EE9SNS_SHIFT) /* 01: Rising edge, whatever EE9POL bit value */
#  define HRTIM_EECR2_EE9SNS_FEDGE      (2 << HRTIM_EECR2_EE9SNS_SHIFT) /* 10: Falling edge, whatever EE9POL bit value */
#  define HRTIM_EECR2_EE9SNS_BEDGE      (3 << HRTIM_EECR2_EE9SNS_SHIFT) /* 11: Both edges, whatever EE9POL bit value */
#define HRTIM_EECR2_EE10SRC_SHIFT       24                              /* Bits 24-25: External Event 10 Source */
#define HRTIM_EECR2_EE10SRC_MASK        (3 << HRTIM_EECR2_EE10SRC_SHIFT)
#  define HRTIM_EECR2_EE10SRC_SRC1      (0 << HRTIM_EECR2_EE10SRC_SHIFT) /* 00: EE10 Src1 */
#  define HRTIM_EECR2_EE10SRC_SRC2      (1 << HRTIM_EECR2_EE10SRC_SHIFT) /* 00: EE10 Src2 */
#  define HRTIM_EECR2_EE10SRC_SRC3      (2 << HRTIM_EECR2_EE10SRC_SHIFT) /* 00: EE10 Src3 */
#  define HRTIM_EECR2_EE10SRC_SRC4      (3 << HRTIM_EECR2_EE10SRC_SHIFT) /* 00: EE10 Src4 */
#define HRTIM_EECR2_EE10POL             (1 << 26)                        /* Bit 26: External Event 10 Polarity */
#define HRTIM_EECR2_EE10SNS_SHIFT       28                               /* Bits 27-28: External Event 10 Sensitivity */
#define HRTIM_EECR2_EE10SNS_MASK        (3 << HRTIM_EECR2_EE10SNS_SHIFT)
#  define HRTIM_EECR2_EE10SNS_ACTIV     (0 << HRTIM_EECR2_EE10SNS_SHIFT) /* 00: On active level defined by EE10POL bit */
#  define HRTIM_EECR2_EE10SNS_REDGE     (1 << HRTIM_EECR2_EE10SNS_SHIFT) /* 01: Rising edge, whatever EE10POL bit value */
#  define HRTIM_EECR2_EE10SNS_FEDGE     (2 << HRTIM_EECR2_EE10SNS_SHIFT) /* 10: Falling edge, whatever EE10POL bit value */
#  define HRTIM_EECR2_EE10SNS_BEDGE     (3 << HRTIM_EECR2_EE10SNS_SHIFT) /* 11: Both edges, whatever EE10POL bit value */

