apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g47xxx_hrtim.h
#define HRTIM_FLTINR2_FLT5E            (1 << 0)                          /* Bit 0: Fault 5 enable */
#define HRTIM_FLTINR2_FLT5P            (1 << 1)                          /* Bit 1: Fault 5 polarity */
#define HRTIM_FLTINR2_FLT5SRC0         (1 << 2)                          /* Bit 2: Fault 5 source bit 0 */
#define HRTIM_FLTINR2_FLT5F_SHIFT      3                                 /* Bits 3-6: Fault 5 filter */
#define HRTIM_FLTINR2_FLT5F_MASK       (15 << HRTIM_FLTINR2_FLT5F_SHIFT)
#  define HRTIM_FLTINR2_FLT5F_NOFLT    (0 << HRTIM_FLTINR2_FLT5F_SHIFT)  /* 0000: No filter, FLT5 acts asynchronously */
#  define HRTIM_FLTINR2_FLT5F_HRTN2    (1 << HRTIM_FLTINR2_FLT5F_SHIFT)  /* 0001: fSAMPLING = fHRTIM, N=2 */
#  define HRTIM_FLTINR2_FLT5F_HRTN4    (2 << HRTIM_FLTINR2_FLT5F_SHIFT)  /* 0010: fSAMPLING = fHRTIM, N=4 */
#  define HRTIM_FLTINR2_FLT5F_HRTN8    (3 << HRTIM_FLTINR2_FLT5F_SHIFT)  /* 0011: fSAMPLING = fHRTIM, N=8 */
#  define HRTIM_FLTINR2_FLT5F_FLTS2N6  (4 << HRTIM_FLTINR2_FLT5F_SHIFT)  /* 0100: fSAMPLING = fFLTS/2, N=6 */
#  define HRTIM_FLTINR2_FLT5F_FLTS2N8  (5 << HRTIM_FLTINR2_FLT5F_SHIFT)  /* 0101: fSAMPLING = fFLTS/2, N=8 */
#  define HRTIM_FLTINR2_FLT5F_FLTS4N6  (6 << HRTIM_FLTINR2_FLT5F_SHIFT)  /* 0110: fSAMPLING = fFLTS/4, N=6 */
#  define HRTIM_FLTINR2_FLT5F_FLTS4N8  (7 << HRTIM_FLTINR2_FLT5F_SHIFT)  /* 0111: fSAMPLING = fFLTS/4, N=8 */
#  define HRTIM_FLTINR2_FLT5F_FLTS8N6  (8 << HRTIM_FLTINR2_FLT5F_SHIFT)  /* 1000: fSAMPLING = fFLTS/8, N=6 */
#  define HRTIM_FLTINR2_FLT5F_FLTS8N8  (9 << HRTIM_FLTINR2_FLT5F_SHIFT)  /* 1001: fSAMPLING = fFLTS/8, N=8 */
#  define HRTIM_FLTINR2_FLT5F_FLTS16N5 (10 << HRTIM_FLTINR2_FLT5F_SHIFT) /* 1010: fSAMPLING = fFLTS/16, N=5 */
#  define HRTIM_FLTINR2_FLT5F_FLTS16N6 (11 << HRTIM_FLTINR2_FLT5F_SHIFT) /* 1011: fSAMPLING = fFLTS/16, N=6 */
#  define HRTIM_FLTINR2_FLT5F_FLTS16N8 (12 << HRTIM_FLTINR2_FLT5F_SHIFT) /* 1100: fSAMPLING = fFLTS/16, N=8 */
#  define HRTIM_FLTINR2_FLT5F_FLTS32N5 (13 << HRTIM_FLTINR2_FLT5F_SHIFT) /* 1101: fSAMPLING = fFLTS/32, N=5 */
#  define HRTIM_FLTINR2_FLT5F_FLTS32N6 (14 << HRTIM_FLTINR2_FLT5F_SHIFT) /* 1110: fSAMPLING = fFLTS/32, N=6 */
#  define HRTIM_FLTINR2_FLT5F_FLTS32N8 (15 << HRTIM_FLTINR2_FLT5F_SHIFT) /* 1111: fSAMPLING = fFLTS/32, N=8 */
#define HRTIM_FLTINR2_FLT5LCK          (1 << 7)                          /* Bit 7: Fault 5 lock */
#define HRTIM_FLTINR2_FLT6E            (1 << 8)                          /* Bit 8: Fault 6 enable */
#define HRTIM_FLTINR2_FLT6P            (1 << 9)                          /* Bit 9: Fault 6 polarity */
#define HRTIM_FLTINR2_FLT6SRC0         (1 << 10)                         /* Bit 10: Fault 6 source bit 0 */
#define HRTIM_FLTINR2_FLT6F_SHIFT      11                                /* Bits 11-14: Fault 6 filter */
#define HRTIM_FLTINR2_FLT6F_MASK       (15 << HRTIM_FLTINR2_FLT6F_SHIFT)
#  define HRTIM_FLTINR2_FLT6F_NOFLT    (0 << HRTIM_FLTINR2_FLT6F_SHIFT)  /* 0000: No filter, FLT6 acts asynchronously */
#  define HRTIM_FLTINR2_FLT6F_HRTN2    (1 << HRTIM_FLTINR2_FLT6F_SHIFT)  /* 0001: fSAMPLING = fHRTIM, N=2 */
#  define HRTIM_FLTINR2_FLT6F_HRTN4    (2 << HRTIM_FLTINR2_FLT6F_SHIFT)  /* 0010: fSAMPLING = fHRTIM, N=4 */
#  define HRTIM_FLTINR2_FLT6F_HRTN8    (3 << HRTIM_FLTINR2_FLT6F_SHIFT)  /* 0011: fSAMPLING = fHRTIM, N=8 */
#  define HRTIM_FLTINR2_FLT6F_FLTS2N6  (4 << HRTIM_FLTINR2_FLT6F_SHIFT)  /* 0100: fSAMPLING = fFLTS/2, N=6 */
#  define HRTIM_FLTINR2_FLT6F_FLTS2N8  (5 << HRTIM_FLTINR2_FLT6F_SHIFT)  /* 0101: fSAMPLING = fFLTS/2, N=8 */
#  define HRTIM_FLTINR2_FLT6F_FLTS4N6  (6 << HRTIM_FLTINR2_FLT6F_SHIFT)  /* 0110: fSAMPLING = fFLTS/4, N=6 */
#  define HRTIM_FLTINR2_FLT6F_FLTS4N8  (7 << HRTIM_FLTINR2_FLT6F_SHIFT)  /* 0111: fSAMPLING = fFLTS/4, N=8 */
#  define HRTIM_FLTINR2_FLT6F_FLTS8N6  (8 << HRTIM_FLTINR2_FLT6F_SHIFT)  /* 1000: fSAMPLING = fFLTS/8, N=6 */
#  define HRTIM_FLTINR2_FLT6F_FLTS8N8  (9 << HRTIM_FLTINR2_FLT6F_SHIFT)  /* 1001: fSAMPLING = fFLTS/8, N=8 */
#  define HRTIM_FLTINR2_FLT6F_FLTS16N5 (10 << HRTIM_FLTINR2_FLT6F_SHIFT) /* 1010: fSAMPLING = fFLTS/16, N=5 */
#  define HRTIM_FLTINR2_FLT6F_FLTS16N6 (11 << HRTIM_FLTINR2_FLT6F_SHIFT) /* 1011: fSAMPLING = fFLTS/16, N=6 */
#  define HRTIM_FLTINR2_FLT6F_FLTS16N8 (12 << HRTIM_FLTINR2_FLT6F_SHIFT) /* 1100: fSAMPLING = fFLTS/16, N=8 */
#  define HRTIM_FLTINR2_FLT6F_FLTS32N5 (13 << HRTIM_FLTINR2_FLT6F_SHIFT) /* 1101: fSAMPLING = fFLTS/32, N=5 */
#  define HRTIM_FLTINR2_FLT6F_FLTS32N6 (14 << HRTIM_FLTINR2_FLT6F_SHIFT) /* 1110: fSAMPLING = fFLTS/32, N=6 */
#  define HRTIM_FLTINR2_FLT6F_FLTS32N8 (15 << HRTIM_FLTINR2_FLT6F_SHIFT) /* 1111: fSAMPLING = fFLTS/32, N=8 */
#define HRTIM_FLTINR2_FLT6LCK          (1 << 7)                          /* Bit 15: Fault 6 lock */
#define HRTIM_FLTINR2_FLT1SRC1         (1 << 16)                         /* Bit 16: Fault 1 source bit 1 */
#define HRTIM_FLTINR2_FLT2SRC1         (1 << 17)                         /* Bit 17: Fault 2 source bit 1 */
#define HRTIM_FLTINR2_FLT3SRC1         (1 << 18)                         /* Bit 18: Fault 3 source bit 1 */
#define HRTIM_FLTINR2_FLT4SRC1         (1 << 19)                         /* Bit 19: Fault 4 source bit 1 */
#define HRTIM_FLTINR2_FLT5SRC1         (1 << 20)                         /* Bit 20: Fault 5 source bit 1 */
#define HRTIM_FLTINR2_FLT6SRC1         (1 << 21)                         /* Bit 21: Fault 6 source bit 1 */
#define HRTIM_FLTINR2_FLTSD_SWITCH     24                                /* Bits 24-25: Fault Sampling clock division */
#define HRTIM_FLTINR2_FLTSD_MASK       (3 << HRTIM_FLTINR2_FLTSD_SWITCH)
#  define HRTIM_FLTINR2_FLTSD_NODIV    (0 << HRTIM_FLTINR2_FLTSD_SWITCH) /* 00: fFLTS=fHRTIM */
#  define HRTIM_FLTINR2_FLTSD_d2       (1 << HRTIM_FLTINR2_FLTSD_SWITCH) /* 01: fFLTS=fHRTIM/2 */
#  define HRTIM_FLTINR2_FLTSD_d4       (2 << HRTIM_FLTINR2_FLTSD_SWITCH) /* 10: fFLTS=fHRTIM/4 */
#  define HRTIM_FLTINR2_FLTSD_d8       (3 << HRTIM_FLTINR2_FLTSD_SWITCH) /* 11: fFLTS=fHRTIM/8 */

/* Common Burst DMA Master Timer Update Register */

