apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g47xxx_hrtim.h
#define HRTIM_BDMUPR_MCR               (1 << 0)  /* Bit 0: MCR register update enable */
#define HRTIM_BDMUPR_MICR              (1 << 1)  /* Bit 1: MICR register update enable  */
#define HRTIM_BDMUPR_MDIER             (1 << 2)  /* Bit 2: MDIER register update enable  */
#define HRTIM_BDMUPR_MCNT              (1 << 3)  /* Bit 3: MCNTR register update enable */
#define HRTIM_BDMUPR_MPER              (1 << 4)  /* Bit 4: MPER register update enable */
#define HRTIM_BDMUPR_MREP              (1 << 5)  /* Bit 5: MREP register update enable */
#define HRTIM_BDMUPR_MCMP1             (1 << 6)  /* Bit 6: MCMP1R register update enable */
#define HRTIM_BDMUPR_MCMP2             (1 << 7)  /* Bit 7: MCMP2R register update enable */
#define HRTIM_BDMUPR_MCMP3             (1 << 8)  /* Bit 8: MCMP3R register update enable */
#define HRTIM_BDMUPR_MCMP4             (1 << 9)  /* Bit 9: MCMP4R register update enable */

/* Common Burst DMA Timer X Update Register (Timer A-F) */

#define HRTIM_BDTxUPR_CR               (1 << 0)  /* Bit 0: HRTIM_TIMxCR register update enable */
#define HRTIM_BDTxUPR_ICR              (1 << 1)  /* Bit 1: HRTIM_TIMxICR register update enable */
#define HRTIM_BDTxUPR_DIER             (1 << 2)  /* Bit 2: HRTIM_TIMxDIER register update enable */
#define HRTIM_BDTxUPR_CNT              (1 << 3)  /* Bit 3: HRTIM_CNTxR register update enable */
#define HRTIM_BDTxUPR_PER              (1 << 4)  /* Bit 4: HRTIM_PERxR register update enable */
#define HRTIM_BDTxUPR_REP              (1 << 5)  /* Bit 5: HRTIM_REPxR register update enable */
#define HRTIM_BDTxUPR_CMP1             (1 << 6)  /* Bit 6: HRTIM_CMP1xR register update enable */
#define HRTIM_BDTxUPR_CMP2             (1 << 7)  /* Bit 7: HRTIM_CMP2xR register update enable */
#define HRTIM_BDTxUPR_CMP3             (1 << 8)  /* Bit 8: HRTIM_CMP3xR register update enable */
#define HRTIM_BDTxUPR_CMP4             (1 << 9)  /* Bit 9: HRTIM_CMP4xR register update enable */
#define HRTIM_BDTxUPR_DTR              (1 << 10) /* Bit 10: HRTIM_DTxR register update enable */
#define HRTIM_BDTxUPR_SET1R            (1 << 11) /* Bit 11: HRTIM_SET1xR register update enable */
#define HRTIM_BDTxUPR_RST1R            (1 << 12) /* Bit 12: HRTIM_RST1xR register update enable */
#define HRTIM_BDTxUPR_SET2R            (1 << 13) /* Bit 13: HRTIM_SET2xR register update enable */
#define HRTIM_BDTxUPR_RST2R            (1 << 14) /* Bit 14: HRTIM_RST2xR register update enable */
#define HRTIM_BDTxUPR_EEFR1            (1 << 15) /* Bit 15: HRTIM_EEFxR1 register update enable */
#define HRTIM_BDTxUPR_EEFR2            (1 << 16) /* Bit 16: HRTIM_EEFxR2 register update enable */
#define HRTIM_BDTxUPR_RSTR             (1 << 17) /* Bit 17: HRTIM_RSTxR register update enable */
#define HRTIM_BDTxUPR_CHPR             (1 << 18) /* Bit 18: HRTIM_CHRxR register update enable */
#define HRTIM_BDTxUPR_OUTR             (1 << 19) /* Bit 19: HRTIM_OUTxR register update enable */
#define HRTIM_BDTxUPR_FLTR             (1 << 20) /* Bit 20: HRTIM_FLTxR register update enable */
#define HRTIM_BDTxUPR_CR2              (1 << 21) /* Bit 21: HRTIM_TIMxCR2 register update enable */
#define HRTIM_BDTxUPR_EEFR3            (1 << 22) /* Bit 22: HRTIM_EEFxR3 register update enable */

/* Common Burst DMA Data Register */

#define HRTIM_BDMADR_SHIFT             0         /* Bits 0-31: Burst DMA Data register */
#define HRTIM_BDMADR_MASK              (0xffffffff << HRTIM_BDMADR_SHIFT)

/* Common ADC extended trigger register */

#define HRTIM_ADCER_ADC5TRG_SHIFT      0                                 /* Bits 0-4: ADC trigger 5 selection */
#define HRTIM_ADCER_ADC5TRG_MASK       (0x1f << HRTIM_ADCER_ADC5TRG_SHIFT)
#  define HRTIM_ADCER_ADC5TRG_MC1      (0 << HRTIM_ADCER_ADC5TRG_SHIFT)  /* 0: Trigger on master compare 1 */
#  define HRTIM_ADCER_ADC5TRG_MC2      (1 << HRTIM_ADCER_ADC5TRG_SHIFT)  /* 1: Trigger on master compare 2 */
#  define HRTIM_ADCER_ADC5TRG_MC3      (2 << HRTIM_ADCER_ADC5TRG_SHIFT)  /* 2: Trigger on master compare 3 */
#  define HRTIM_ADCER_ADC5TRG_MC4      (3 << HRTIM_ADCER_ADC5TRG_SHIFT)  /* 3: Trigger on master compare 4 */
#  define HRTIM_ADCER_ADC5TRG_MPER     (4 << HRTIM_ADCER_ADC5TRG_SHIFT)  /* 4: Trigger on  master period */
#  define HRTIM_ADCER_ADC5TRG_EE1      (5 << HRTIM_ADCER_ADC5TRG_SHIFT)  /* 5: Trigger on external event 1 */
#  define HRTIM_ADCER_ADC5TRG_EE2      (6 << HRTIM_ADCER_ADC5TRG_SHIFT)  /* 6: Trigger on external event 2 */
#  define HRTIM_ADCER_ADC5TRG_EE3      (7 << HRTIM_ADCER_ADC5TRG_SHIFT)  /* 7: Trigger on external event 3 */
#  define HRTIM_ADCER_ADC5TRG_EE4      (8 << HRTIM_ADCER_ADC5TRG_SHIFT)  /* 8: Trigger on external event 4 */
#  define HRTIM_ADCER_ADC5TRG_EE5      (9 << HRTIM_ADCER_ADC5TRG_SHIFT)  /* 9: Trigger on external event 5 */
#  define HRTIM_ADCER_ADC5TRG_TAC3     (10 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 10: Trigger on timer A compare 3 */
#  define HRTIM_ADCER_ADC5TRG_TAC4     (11 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 11: Trigger on timer A compare 4 */
#  define HRTIM_ADCER_ADC5TRG_TAPER    (12 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 12: Trigger on timer A period */
#  define HRTIM_ADCER_ADC5TRG_TARST    (13 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 13: Trigger on timer A reset and counter roll-over */
#  define HRTIM_ADCER_ADC5TRG_TBC3     (14 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 14: Trigger on timer B compare 3 */
#  define HRTIM_ADCER_ADC5TRG_TBC4     (15 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 15: Trigger on timer B compare 4 */
#  define HRTIM_ADCER_ADC5TRG_TBPER    (16 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 16: Trigger on timer B period */
#  define HRTIM_ADCER_ADC5TRG_TBRST    (17 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 17: Trigger on timer B reset and counter roll-over */
#  define HRTIM_ADCER_ADC5TRG_TCC3     (18 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 18: Trigger on timer C compare 3 */
#  define HRTIM_ADCER_ADC5TRG_TCC4     (19 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 19: Trigger on timer C compare 4 */
#  define HRTIM_ADCER_ADC5TRG_TCPER    (20 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 20: Trigger on timer C period */
#  define HRTIM_ADCER_ADC5TRG_TDC3     (21 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 21: Trigger on timer D compare 3 */
#  define HRTIM_ADCER_ADC5TRG_TDC4     (22 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 22: Trigger on timer D compare 4 */
#  define HRTIM_ADCER_ADC5TRG_TDPER    (23 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 23: Trigger on timer D period */
#  define HRTIM_ADCER_ADC5TRG_TEC3     (24 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 24: Trigger on timer E compare 3 */
#  define HRTIM_ADCER_ADC5TRG_TEC4     (25 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 25: Trigger on timer E compare 4 */
#  define HRTIM_ADCER_ADC5TRG_TEPER    (26 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 26: Trigger on timer E period */
#  define HRTIM_ADCER_ADC5TRG_TFC2     (27 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 27: Trigger on timer F compare 2 */
#  define HRTIM_ADCER_ADC5TRG_TFC3     (28 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 28: Trigger on timer F compare 3 */
#  define HRTIM_ADCER_ADC5TRG_TFC4     (29 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 29: Trigger on timer F compare 4 */
#  define HRTIM_ADCER_ADC5TRG_TFPER    (30 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 30: Trigger on timer F period */
#  define HRTIM_ADCER_ADC5TRG_TFRST    (31 << HRTIM_ADCER_ADC5TRG_SHIFT) /* 31: Trigger on timer F reset and counter roll-over */
#define HRTIM_ADCER_ADC6TRG_SHIFT      5                                 /* Bits 5-9: ADC trigger 6 selection */
#define HRTIM_ADCER_ADC6TRG_MASK       (0x1f << HRTIM_ADCER_ADC6TRG_SHIFT)
#  define HRTIM_ADCER_ADC6TRG_MC1      (0 << HRTIM_ADCER_ADC6TRG_SHIFT)  /* 0: Trigger on master compare 1 */
#  define HRTIM_ADCER_ADC6TRG_MC2      (1 << HRTIM_ADCER_ADC6TRG_SHIFT)  /* 1: Trigger on master compare 2 */
#  define HRTIM_ADCER_ADC6TRG_MC3      (2 << HRTIM_ADCER_ADC6TRG_SHIFT)  /* 2: Trigger on master compare 3 */
#  define HRTIM_ADCER_ADC6TRG_MC4      (3 << HRTIM_ADCER_ADC6TRG_SHIFT)  /* 3: Trigger on master compare 4 */
#  define HRTIM_ADCER_ADC6TRG_MPER     (4 << HRTIM_ADCER_ADC6TRG_SHIFT)  /* 4: Trigger on  master period */
#  define HRTIM_ADCER_ADC6TRG_EE6      (5 << HRTIM_ADCER_ADC6TRG_SHIFT)  /* 5: Trigger on external event 6 */
#  define HRTIM_ADCER_ADC6TRG_EE7      (6 << HRTIM_ADCER_ADC6TRG_SHIFT)  /* 6: Trigger on external event 7 */
#  define HRTIM_ADCER_ADC6TRG_EE8      (7 << HRTIM_ADCER_ADC6TRG_SHIFT)  /* 7: Trigger on external event 8 */
#  define HRTIM_ADCER_ADC6TRG_EE9      (8 << HRTIM_ADCER_ADC6TRG_SHIFT)  /* 8: Trigger on external event 9 */
#  define HRTIM_ADCER_ADC6TRG_EE10     (9 << HRTIM_ADCER_ADC6TRG_SHIFT)  /* 9: Trigger on external event 10 */
#  define HRTIM_ADCER_ADC6TRG_TAC2     (10 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 10: Trigger on timer A compare 2 */
#  define HRTIM_ADCER_ADC6TRG_TAC4     (11 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 11: Trigger on timer A compare 4 */
#  define HRTIM_ADCER_ADC6TRG_TAPER    (12 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 12: Trigger on timer A period */
#  define HRTIM_ADCER_ADC6TRG_TBC2     (13 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 13: Trigger on timer B compare 2 */
#  define HRTIM_ADCER_ADC6TRG_TBC4     (14 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 14: Trigger on timer B compare 4 */
#  define HRTIM_ADCER_ADC6TRG_TBPER    (15 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 15: Trigger on timer B period */
#  define HRTIM_ADCER_ADC6TRG_TCC2     (16 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 16: Trigger on timer C compare 2 */
#  define HRTIM_ADCER_ADC6TRG_TCC4     (17 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 17: Trigger on timer C compare 4 */
#  define HRTIM_ADCER_ADC6TRG_TCPER    (18 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 18: Trigger on timer C period */
#  define HRTIM_ADCER_ADC6TRG_TCRST    (19 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 19: Trigger on timer C reset and counter roll-over */
#  define HRTIM_ADCER_ADC6TRG_TDC2     (20 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 20: Trigger on timer D compare 2 */
#  define HRTIM_ADCER_ADC6TRG_TDC4     (21 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 21: Trigger on timer D compare 4 */
#  define HRTIM_ADCER_ADC6TRG_TDPER    (22 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 22: Trigger on timer D period */
#  define HRTIM_ADCER_ADC6TRG_TDRST    (23 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 23: Trigger on timer D reset and counter roll-over */
#  define HRTIM_ADCER_ADC6TRG_TEC2     (24 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 24: Trigger on timer E compare 2 */
#  define HRTIM_ADCER_ADC6TRG_TEC3     (25 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 25: Trigger on timer E compare 3 */
#  define HRTIM_ADCER_ADC6TRG_TEC4     (26 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 26: Trigger on timer E compare 4 */
#  define HRTIM_ADCER_ADC6TRG_TERST    (27 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 27: Trigger on timer E reset and counter roll-over */
#  define HRTIM_ADCER_ADC6TRG_TFC2     (28 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 28: Trigger on timer F compare 2 */
#  define HRTIM_ADCER_ADC6TRG_TFC3     (29 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 29: Trigger on timer F compare 3 */
#  define HRTIM_ADCER_ADC6TRG_TFC4     (30 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 30: Trigger on timer F compare 4 */
#  define HRTIM_ADCER_ADC6TRG_TFPER    (31 << HRTIM_ADCER_ADC6TRG_SHIFT) /* 31: Trigger on timer F period */
#define HRTIM_ADCER_ADC7TRG_SHIFT      10                                /* Bits 10-14: ADC trigger 7 selection */
#define HRTIM_ADCER_ADC7TRG_MASK       (0x1f << HRTIM_ADCER_ADC7TRG_SHIFT)
#  define HRTIM_ADCER_ADC7TRG_MC1      (0 << HRTIM_ADCER_ADC7TRG_SHIFT)  /* 0: Trigger on master compare 1 */
#  define HRTIM_ADCER_ADC7TRG_MC2      (1 << HRTIM_ADCER_ADC7TRG_SHIFT)  /* 1: Trigger on master compare 2 */
#  define HRTIM_ADCER_ADC7TRG_MC3      (2 << HRTIM_ADCER_ADC7TRG_SHIFT)  /* 2: Trigger on master compare 3 */
#  define HRTIM_ADCER_ADC7TRG_MC4      (3 << HRTIM_ADCER_ADC7TRG_SHIFT)  /* 3: Trigger on master compare 4 */
#  define HRTIM_ADCER_ADC7TRG_MPER     (4 << HRTIM_ADCER_ADC7TRG_SHIFT)  /* 4: Trigger on  master period */
#  define HRTIM_ADCER_ADC7TRG_EE1      (5 << HRTIM_ADCER_ADC7TRG_SHIFT)  /* 5: Trigger on external event 1 */
#  define HRTIM_ADCER_ADC7TRG_EE2      (6 << HRTIM_ADCER_ADC7TRG_SHIFT)  /* 6: Trigger on external event 2 */
#  define HRTIM_ADCER_ADC7TRG_EE3      (7 << HRTIM_ADCER_ADC7TRG_SHIFT)  /* 7: Trigger on external event 3 */
#  define HRTIM_ADCER_ADC7TRG_EE4      (8 << HRTIM_ADCER_ADC7TRG_SHIFT)  /* 8: Trigger on external event 4 */
#  define HRTIM_ADCER_ADC7TRG_EE5      (9 << HRTIM_ADCER_ADC7TRG_SHIFT)  /* 9: Trigger on external event 5 */
#  define HRTIM_ADCER_ADC7TRG_TAC3     (10 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 10: Trigger on timer A compare 3 */
#  define HRTIM_ADCER_ADC7TRG_TAC4     (11 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 11: Trigger on timer A compare 4 */
#  define HRTIM_ADCER_ADC7TRG_TAPER    (12 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 12: Trigger on timer A period */
#  define HRTIM_ADCER_ADC7TRG_TARST    (13 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 13: Trigger on timer A reset and counter roll-over */
#  define HRTIM_ADCER_ADC7TRG_TBC3     (14 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 14: Trigger on timer B compare 3 */
#  define HRTIM_ADCER_ADC7TRG_TBC4     (15 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 15: Trigger on timer B compare 4 */
#  define HRTIM_ADCER_ADC7TRG_TBPER    (16 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 16: Trigger on timer B period */
#  define HRTIM_ADCER_ADC7TRG_TBRST    (17 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 17: Trigger on timer B reset and counter roll-over */
#  define HRTIM_ADCER_ADC7TRG_TCC3     (18 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 18: Trigger on timer C compare 3 */
#  define HRTIM_ADCER_ADC7TRG_TCC4     (19 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 19: Trigger on timer C compare 4 */
#  define HRTIM_ADCER_ADC7TRG_TCPER    (20 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 20: Trigger on timer C period */
#  define HRTIM_ADCER_ADC7TRG_TDC3     (21 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 21: Trigger on timer D compare 3 */
#  define HRTIM_ADCER_ADC7TRG_TDC4     (22 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 22: Trigger on timer D compare 4 */
#  define HRTIM_ADCER_ADC7TRG_TDPER    (23 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 23: Trigger on timer D period */
#  define HRTIM_ADCER_ADC7TRG_TEC3     (24 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 24: Trigger on timer E compare 3 */
#  define HRTIM_ADCER_ADC7TRG_TEC4     (25 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 25: Trigger on timer E compare 4 */
#  define HRTIM_ADCER_ADC7TRG_TEPER    (26 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 26: Trigger on timer E period */
#  define HRTIM_ADCER_ADC7TRG_TFC2     (27 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 27: Trigger on timer F compare 2 */
#  define HRTIM_ADCER_ADC7TRG_TFC3     (28 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 28: Trigger on timer F compare 3 */
#  define HRTIM_ADCER_ADC7TRG_TFC4     (29 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 29: Trigger on timer F compare 4 */
#  define HRTIM_ADCER_ADC7TRG_TFPER    (30 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 30: Trigger on timer F period */
#  define HRTIM_ADCER_ADC7TRG_TFRST    (31 << HRTIM_ADCER_ADC7TRG_SHIFT) /* 31: Trigger on timer F reset and counter roll-over */
#define HRTIM_ADCER_ADC8TRG_SHIFT      16                                /* Bits 16-20: ADC trigger 8 selection */
#define HRTIM_ADCER_ADC8TRG_MASK       (0x1f << HRTIM_ADCER_ADC8TRG_SHIFT)
#  define HRTIM_ADCER_ADC8TRG_MC1      (0 << HRTIM_ADCER_ADC8TRG_SHIFT)  /* 0: Trigger on master compare 1 */
#  define HRTIM_ADCER_ADC8TRG_MC2      (1 << HRTIM_ADCER_ADC8TRG_SHIFT)  /* 1: Trigger on master compare 2 */
#  define HRTIM_ADCER_ADC8TRG_MC3      (2 << HRTIM_ADCER_ADC8TRG_SHIFT)  /* 2: Trigger on master compare 3 */
#  define HRTIM_ADCER_ADC8TRG_MC4      (3 << HRTIM_ADCER_ADC8TRG_SHIFT)  /* 3: Trigger on master compare 4 */
#  define HRTIM_ADCER_ADC8TRG_MPER     (4 << HRTIM_ADCER_ADC8TRG_SHIFT)  /* 4: Trigger on  master period */
#  define HRTIM_ADCER_ADC8TRG_EE6      (5 << HRTIM_ADCER_ADC8TRG_SHIFT)  /* 5: Trigger on external event 6 */
#  define HRTIM_ADCER_ADC8TRG_EE7      (6 << HRTIM_ADCER_ADC8TRG_SHIFT)  /* 6: Trigger on external event 7 */
#  define HRTIM_ADCER_ADC8TRG_EE8      (7 << HRTIM_ADCER_ADC8TRG_SHIFT)  /* 7: Trigger on external event 8 */
#  define HRTIM_ADCER_ADC8TRG_EE9      (8 << HRTIM_ADCER_ADC8TRG_SHIFT)  /* 8: Trigger on external event 9 */
#  define HRTIM_ADCER_ADC8TRG_EE10     (9 << HRTIM_ADCER_ADC8TRG_SHIFT)  /* 9: Trigger on external event 10 */
#  define HRTIM_ADCER_ADC8TRG_TAC2     (10 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 10: Trigger on timer A compare 2 */
#  define HRTIM_ADCER_ADC8TRG_TAC4     (11 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 11: Trigger on timer A compare 4 */
#  define HRTIM_ADCER_ADC8TRG_TAPER    (12 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 12: Trigger on timer A period */
#  define HRTIM_ADCER_ADC8TRG_TBC2     (13 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 13: Trigger on timer B compare 2 */
#  define HRTIM_ADCER_ADC8TRG_TBC4     (14 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 14: Trigger on timer B compare 4 */
#  define HRTIM_ADCER_ADC8TRG_TBPER    (15 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 15: Trigger on timer B period */
#  define HRTIM_ADCER_ADC8TRG_TCC2     (16 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 16: Trigger on timer C compare 2 */
#  define HRTIM_ADCER_ADC8TRG_TCC4     (17 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 17: Trigger on timer C compare 4 */
#  define HRTIM_ADCER_ADC8TRG_TCPER    (18 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 18: Trigger on timer C period */
#  define HRTIM_ADCER_ADC8TRG_TCRST    (19 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 19: Trigger on timer C reset and counter roll-over */
#  define HRTIM_ADCER_ADC8TRG_TDC2     (20 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 20: Trigger on timer D compare 2 */
#  define HRTIM_ADCER_ADC8TRG_TDC4     (21 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 21: Trigger on timer D compare 4 */
#  define HRTIM_ADCER_ADC8TRG_TDPER    (22 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 22: Trigger on timer D period */
#  define HRTIM_ADCER_ADC8TRG_TDRST    (23 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 23: Trigger on timer D reset and counter roll-over */
#  define HRTIM_ADCER_ADC8TRG_TEC2     (24 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 24: Trigger on timer E compare 2 */
#  define HRTIM_ADCER_ADC8TRG_TEC3     (25 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 25: Trigger on timer E compare 3 */
#  define HRTIM_ADCER_ADC8TRG_TEC4     (26 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 26: Trigger on timer E compare 4 */
#  define HRTIM_ADCER_ADC8TRG_TERST    (27 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 27: Trigger on timer E reset and counter roll-over */
#  define HRTIM_ADCER_ADC8TRG_TFC2     (28 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 28: Trigger on timer F compare 2 */
#  define HRTIM_ADCER_ADC8TRG_TFC3     (29 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 29: Trigger on timer F compare 3 */
#  define HRTIM_ADCER_ADC8TRG_TFC4     (30 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 30: Trigger on timer F compare 4 */
#  define HRTIM_ADCER_ADC8TRG_TFPER    (31 << HRTIM_ADCER_ADC8TRG_SHIFT) /* 31: Trigger on timer F period */
#define HRTIM_ADCER_ADC9TRG_SHIFT      21                                /* Bits 21-25: ADC trigger 9 selection */
#define HRTIM_ADCER_ADC9TRG_MASK       (0x1f << HRTIM_ADCER_ADC9TRG_SHIFT)
#  define HRTIM_ADCER_ADC9TRG_MC1      (0 << HRTIM_ADCER_ADC9TRG_SHIFT)  /* 0: Trigger on master compare 1 */
#  define HRTIM_ADCER_ADC9TRG_MC2      (1 << HRTIM_ADCER_ADC9TRG_SHIFT)  /* 1: Trigger on master compare 2 */
#  define HRTIM_ADCER_ADC9TRG_MC3      (2 << HRTIM_ADCER_ADC9TRG_SHIFT)  /* 2: Trigger on master compare 3 */
#  define HRTIM_ADCER_ADC9TRG_MC4      (3 << HRTIM_ADCER_ADC9TRG_SHIFT)  /* 3: Trigger on master compare 4 */
#  define HRTIM_ADCER_ADC9TRG_MPER     (4 << HRTIM_ADCER_ADC9TRG_SHIFT)  /* 4: Trigger on  master period */
#  define HRTIM_ADCER_ADC9TRG_EE1      (5 << HRTIM_ADCER_ADC9TRG_SHIFT)  /* 5: Trigger on external event 1 */
#  define HRTIM_ADCER_ADC9TRG_EE2      (6 << HRTIM_ADCER_ADC9TRG_SHIFT)  /* 6: Trigger on external event 2 */
#  define HRTIM_ADCER_ADC9TRG_EE3      (7 << HRTIM_ADCER_ADC9TRG_SHIFT)  /* 7: Trigger on external event 3 */
#  define HRTIM_ADCER_ADC9TRG_EE4      (8 << HRTIM_ADCER_ADC9TRG_SHIFT)  /* 8: Trigger on external event 4 */
#  define HRTIM_ADCER_ADC9TRG_EE5      (9 << HRTIM_ADCER_ADC9TRG_SHIFT)  /* 9: Trigger on external event 5 */
#  define HRTIM_ADCER_ADC9TRG_TAC3     (10 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 10: Trigger on timer A compare 3 */
#  define HRTIM_ADCER_ADC9TRG_TAC4     (11 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 11: Trigger on timer A compare 4 */
#  define HRTIM_ADCER_ADC9TRG_TAPER    (12 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 12: Trigger on timer A period */
#  define HRTIM_ADCER_ADC9TRG_TARST    (13 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 13: Trigger on timer A reset and counter roll-over */
#  define HRTIM_ADCER_ADC9TRG_TBC3     (14 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 14: Trigger on timer B compare 3 */
#  define HRTIM_ADCER_ADC9TRG_TBC4     (15 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 15: Trigger on timer B compare 4 */
#  define HRTIM_ADCER_ADC9TRG_TBPER    (16 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 16: Trigger on timer B period */
#  define HRTIM_ADCER_ADC9TRG_TBRST    (17 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 17: Trigger on timer B reset and counter roll-over */
#  define HRTIM_ADCER_ADC9TRG_TCC3     (18 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 18: Trigger on timer C compare 3 */
#  define HRTIM_ADCER_ADC9TRG_TCC4     (19 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 19: Trigger on timer C compare 4 */
#  define HRTIM_ADCER_ADC9TRG_TCPER    (20 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 20: Trigger on timer C period */
#  define HRTIM_ADCER_ADC9TRG_TDC3     (21 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 21: Trigger on timer D compare 3 */
#  define HRTIM_ADCER_ADC9TRG_TDC4     (22 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 22: Trigger on timer D compare 4 */
#  define HRTIM_ADCER_ADC9TRG_TDPER    (23 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 23: Trigger on timer D period */
#  define HRTIM_ADCER_ADC9TRG_TEC3     (24 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 24: Trigger on timer E compare 3 */
#  define HRTIM_ADCER_ADC9TRG_TEC4     (25 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 25: Trigger on timer E compare 4 */
#  define HRTIM_ADCER_ADC9TRG_TEPER    (26 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 26: Trigger on timer E period */
#  define HRTIM_ADCER_ADC9TRG_TFC2     (27 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 27: Trigger on timer F compare 2 */
#  define HRTIM_ADCER_ADC9TRG_TFC3     (28 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 28: Trigger on timer F compare 3 */
#  define HRTIM_ADCER_ADC9TRG_TFC4     (29 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 29: Trigger on timer F compare 4 */
#  define HRTIM_ADCER_ADC9TRG_TFPER    (30 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 30: Trigger on timer F period */
#  define HRTIM_ADCER_ADC9TRG_TFRST    (31 << HRTIM_ADCER_ADC9TRG_SHIFT) /* 31: Trigger on timer F reset and counter roll-over */
#define HRTIM_ADCER_ADC10TRG_SHIFT     26                                /* Bits 26-30: ADC trigger 10 selection */
#define HRTIM_ADCER_ADC10TRG_MASK      (0x1f << HRTIM_ADCER_ADC10TRG_SHIFT)
#  define HRTIM_ADCER_ADC10TRG_MC1     (0 << HRTIM_ADCER_ADC10TRG_SHIFT)  /* 0: Trigger on master compare 1 */
#  define HRTIM_ADCER_ADC10TRG_MC2     (1 << HRTIM_ADCER_ADC10TRG_SHIFT)  /* 1: Trigger on master compare 2 */
#  define HRTIM_ADCER_ADC10TRG_MC3     (2 << HRTIM_ADCER_ADC10TRG_SHIFT)  /* 2: Trigger on master compare 3 */
#  define HRTIM_ADCER_ADC10TRG_MC4     (3 << HRTIM_ADCER_ADC10TRG_SHIFT)  /* 3: Trigger on master compare 4 */
#  define HRTIM_ADCER_ADC10TRG_MPER    (4 << HRTIM_ADCER_ADC10TRG_SHIFT)  /* 4: Trigger on  master period */
#  define HRTIM_ADCER_ADC10TRG_EE6     (5 << HRTIM_ADCER_ADC10TRG_SHIFT)  /* 5: Trigger on external event 6 */
#  define HRTIM_ADCER_ADC10TRG_EE7     (6 << HRTIM_ADCER_ADC10TRG_SHIFT)  /* 6: Trigger on external event 7 */
#  define HRTIM_ADCER_ADC10TRG_EE8     (7 << HRTIM_ADCER_ADC10TRG_SHIFT)  /* 7: Trigger on external event 8 */
#  define HRTIM_ADCER_ADC10TRG_EE9     (8 << HRTIM_ADCER_ADC10TRG_SHIFT)  /* 8: Trigger on external event 9 */
#  define HRTIM_ADCER_ADC10TRG_EE10    (9 << HRTIM_ADCER_ADC10TRG_SHIFT)  /* 9: Trigger on external event 10 */
#  define HRTIM_ADCER_ADC10TRG_TAC2    (10 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 10: Trigger on timer A compare 2 */
#  define HRTIM_ADCER_ADC10TRG_TAC4    (11 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 11: Trigger on timer A compare 4 */
