apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g47xxx_hrtim.h
#  define HRTIM_ADCER_ADC10TRG_TAPER   (12 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 12: Trigger on timer A period */
#  define HRTIM_ADCER_ADC10TRG_TBC2    (13 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 13: Trigger on timer B compare 2 */
#  define HRTIM_ADCER_ADC10TRG_TBC4    (14 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 14: Trigger on timer B compare 4 */
#  define HRTIM_ADCER_ADC10TRG_TBPER   (15 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 15: Trigger on timer B period */
#  define HRTIM_ADCER_ADC10TRG_TCC2    (16 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 16: Trigger on timer C compare 2 */
#  define HRTIM_ADCER_ADC10TRG_TCC4    (17 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 17: Trigger on timer C compare 4 */
#  define HRTIM_ADCER_ADC10TRG_TCPER   (18 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 18: Trigger on timer C period */
#  define HRTIM_ADCER_ADC10TRG_TCRST   (19 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 19: Trigger on timer C reset and counter roll-over */
#  define HRTIM_ADCER_ADC10TRG_TDC2    (20 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 20: Trigger on timer D compare 2 */
#  define HRTIM_ADCER_ADC10TRG_TDC4    (21 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 21: Trigger on timer D compare 4 */
#  define HRTIM_ADCER_ADC10TRG_TDPER   (22 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 22: Trigger on timer D period */
#  define HRTIM_ADCER_ADC10TRG_TDRST   (23 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 23: Trigger on timer D reset and counter roll-over */
#  define HRTIM_ADCER_ADC10TRG_TEC2    (24 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 24: Trigger on timer E compare 2 */
#  define HRTIM_ADCER_ADC10TRG_TEC3    (25 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 25: Trigger on timer E compare 3 */
#  define HRTIM_ADCER_ADC10TRG_TEC4    (26 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 26: Trigger on timer E compare 4 */
#  define HRTIM_ADCER_ADC10TRG_TERST   (27 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 27: Trigger on timer E reset and counter roll-over */
#  define HRTIM_ADCER_ADC10TRG_TFC2    (28 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 28: Trigger on timer F compare 2 */
#  define HRTIM_ADCER_ADC10TRG_TFC3    (29 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 29: Trigger on timer F compare 3 */
#  define HRTIM_ADCER_ADC10TRG_TFC4    (30 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 30: Trigger on timer F compare 4 */
#  define HRTIM_ADCER_ADC10TRG_TFPER   (31 << HRTIM_ADCER_ADC10TRG_SHIFT) /* 31: Trigger on timer F period */

/* Common ADC trigger update register */

#define HRTIM_ADCUR_AD5USRC_SHIFT      0                                 /* Bits 0-2: ADC trigger 5 update source */
#define HRTIM_ADCUR_AD5USRC_MASK       (7 << HRTIM_ADCUR_AD5USRC_SHIFT)
#  define HRTIM_ADCUR_AD5USRC_MT       (0 << HRTIM_ADCUR_AD5USRC_SHIFT)  /* 0: Master timer */
#  define HRTIM_ADCUR_AD5USRC_TA       (1 << HRTIM_ADCUR_AD5USRC_SHIFT)  /* 1: Timer A */
#  define HRTIM_ADCUR_AD5USRC_TB       (2 << HRTIM_ADCUR_AD5USRC_SHIFT)  /* 2: Timer B */
#  define HRTIM_ADCUR_AD5USRC_TC       (3 << HRTIM_ADCUR_AD5USRC_SHIFT)  /* 3: Timer C */
#  define HRTIM_ADCUR_AD5USRC_TD       (4 << HRTIM_ADCUR_AD5USRC_SHIFT)  /* 4: Timer D */
#  define HRTIM_ADCUR_AD5USRC_TE       (5 << HRTIM_ADCUR_AD5USRC_SHIFT)  /* 5: Timer E */
#  define HRTIM_ADCUR_AD5USRC_TF       (6 << HRTIM_ADCUR_AD5USRC_SHIFT)  /* 6: Timer F */
#define HRTIM_ADCUR_AD6USRC_SHIFT      4                                 /* Bits 4-6: ADC trigger 6 update source */
#define HRTIM_ADCUR_AD6USRC_MASK       (7 << HRTIM_ADCUR_AD6USRC_SHIFT)
#  define HRTIM_ADCUR_AD6USRC_MT       (0 << HRTIM_ADCUR_AD6USRC_SHIFT)  /* 0: Master timer */
#  define HRTIM_ADCUR_AD6USRC_TA       (1 << HRTIM_ADCUR_AD6USRC_SHIFT)  /* 1: Timer A */
#  define HRTIM_ADCUR_AD6USRC_TB       (2 << HRTIM_ADCUR_AD6USRC_SHIFT)  /* 2: Timer B */
#  define HRTIM_ADCUR_AD6USRC_TC       (3 << HRTIM_ADCUR_AD6USRC_SHIFT)  /* 3: Timer C */
#  define HRTIM_ADCUR_AD6USRC_TD       (4 << HRTIM_ADCUR_AD6USRC_SHIFT)  /* 4: Timer D */
#  define HRTIM_ADCUR_AD6USRC_TE       (5 << HRTIM_ADCUR_AD6USRC_SHIFT)  /* 5: Timer E */
#  define HRTIM_ADCUR_AD6USRC_TF       (6 << HRTIM_ADCUR_AD6USRC_SHIFT)  /* 6: Timer F */
#define HRTIM_ADCUR_AD7USRC_SHIFT      8                                 /* Bits 8-10: ADC trigger 7 update source */
#define HRTIM_ADCUR_AD7USRC_MASK       (7 << HRTIM_ADCUR_AD7USRC_SHIFT)
#  define HRTIM_ADCUR_AD7USRC_MT       (0 << HRTIM_ADCUR_AD7USRC_SHIFT)  /* 0: Master timer */
#  define HRTIM_ADCUR_AD7USRC_TA       (1 << HRTIM_ADCUR_AD7USRC_SHIFT)  /* 1: Timer A */
#  define HRTIM_ADCUR_AD7USRC_TB       (2 << HRTIM_ADCUR_AD7USRC_SHIFT)  /* 2: Timer B */
#  define HRTIM_ADCUR_AD7USRC_TC       (3 << HRTIM_ADCUR_AD7USRC_SHIFT)  /* 3: Timer C */
#  define HRTIM_ADCUR_AD7USRC_TD       (4 << HRTIM_ADCUR_AD7USRC_SHIFT)  /* 4: Timer D */
#  define HRTIM_ADCUR_AD7USRC_TE       (5 << HRTIM_ADCUR_AD7USRC_SHIFT)  /* 5: Timer E */
#  define HRTIM_ADCUR_AD7USRC_TF       (6 << HRTIM_ADCUR_AD7USRC_SHIFT)  /* 6: Timer F */
#define HRTIM_ADCUR_AD8USRC_SHIFT      12                                /* Bits 12-14: ADC trigger 8 update source */
#define HRTIM_ADCUR_AD8USRC_MASK       (7 << HRTIM_ADCUR_AD8USRC_SHIFT)
#  define HRTIM_ADCUR_AD8USRC_MT       (0 << HRTIM_ADCUR_AD8USRC_SHIFT)  /* 0: Master timer */
#  define HRTIM_ADCUR_AD8USRC_TA       (1 << HRTIM_ADCUR_AD8USRC_SHIFT)  /* 1: Timer A */
#  define HRTIM_ADCUR_AD8USRC_TB       (2 << HRTIM_ADCUR_AD8USRC_SHIFT)  /* 2: Timer B */
#  define HRTIM_ADCUR_AD8USRC_TC       (3 << HRTIM_ADCUR_AD8USRC_SHIFT)  /* 3: Timer C */
#  define HRTIM_ADCUR_AD8USRC_TD       (4 << HRTIM_ADCUR_AD8USRC_SHIFT)  /* 4: Timer D */
#  define HRTIM_ADCUR_AD8USRC_TE       (5 << HRTIM_ADCUR_AD8USRC_SHIFT)  /* 5: Timer E */
#  define HRTIM_ADCUR_AD8USRC_TF       (6 << HRTIM_ADCUR_AD8USRC_SHIFT)  /* 6: Timer F */
#define HRTIM_ADCUR_AD9USRC_SHIFT      16                                /* Bits 16-18: ADC trigger 9 update source */
#define HRTIM_ADCUR_AD9USRC_MASK       (7 << HRTIM_ADCUR_AD9USRC_SHIFT)
#  define HRTIM_ADCUR_AD9USRC_MT       (0 << HRTIM_ADCUR_AD9USRC_SHIFT)  /* 0: Master timer */
#  define HRTIM_ADCUR_AD9USRC_TA       (1 << HRTIM_ADCUR_AD9USRC_SHIFT)  /* 1: Timer A */
#  define HRTIM_ADCUR_AD9USRC_TB       (2 << HRTIM_ADCUR_AD9USRC_SHIFT)  /* 2: Timer B */
#  define HRTIM_ADCUR_AD9USRC_TC       (3 << HRTIM_ADCUR_AD9USRC_SHIFT)  /* 3: Timer C */
#  define HRTIM_ADCUR_AD9USRC_TD       (4 << HRTIM_ADCUR_AD9USRC_SHIFT)  /* 4: Timer D */
#  define HRTIM_ADCUR_AD9USRC_TE       (5 << HRTIM_ADCUR_AD9USRC_SHIFT)  /* 5: Timer E */
#  define HRTIM_ADCUR_AD9USRC_TF       (6 << HRTIM_ADCUR_AD9USRC_SHIFT)  /* 6: Timer F */
#define HRTIM_ADCUR_AD10USRC_SHIFT     20                                /* Bits 20-22: ADC trigger 10 update source */
#define HRTIM_ADCUR_AD10USRC_MASK      (7 << HRTIM_ADCUR_AD10USRC_SHIFT)
#  define HRTIM_ADCUR_AD10USRC_MT      (0 << HRTIM_ADCUR_AD10USRC_SHIFT) /* 0: Master timer */
#  define HRTIM_ADCUR_AD10USRC_TA      (1 << HRTIM_ADCUR_AD10USRC_SHIFT) /* 1: Timer A */
#  define HRTIM_ADCUR_AD10USRC_TB      (2 << HRTIM_ADCUR_AD10USRC_SHIFT) /* 2: Timer B */
#  define HRTIM_ADCUR_AD10USRC_TC      (3 << HRTIM_ADCUR_AD10USRC_SHIFT) /* 3: Timer C */
#  define HRTIM_ADCUR_AD10USRC_TD      (4 << HRTIM_ADCUR_AD10USRC_SHIFT) /* 4: Timer D */
#  define HRTIM_ADCUR_AD10USRC_TE      (5 << HRTIM_ADCUR_AD10USRC_SHIFT) /* 5: Timer E */
#  define HRTIM_ADCUR_AD10USRC_TF      (6 << HRTIM_ADCUR_AD10USRC_SHIFT) /* 6: Timer F */

/* Common ADC post scaler register 1 */

