apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g47xxx_hrtim.h
#define HRTIM_ADCPS1_ADC1PSC_SHIFT     0                                 /* Bits 0-4: ADC 1 post scaler */
#define HRTIM_ADCPS1_ADC1PSC_MASK      (0x1f << HRTIM_ADCPS1_ADC1PSC_SHIFT)
#define HRTIM_ADCPS1_ADC2PSC_SHIFT     6                                 /* Bits 6-10: ADC 2 post scaler */
#define HRTIM_ADCPS1_ADC2PSC_MASK      (0x1f << HRTIM_ADCPS1_ADC2PSC_SHIFT)
#define HRTIM_ADCPS1_ADC3PSC_SHIFT     12                                /* Bits 12-16: ADC 3 post scaler */
#define HRTIM_ADCPS1_ADC3PSC_MASK      (0x1f << HRTIM_ADCPS1_ADC3PSC_SHIFT)
#define HRTIM_ADCPS1_ADC4PSC_SHIFT     18                                /* Bits 18-22: ADC 4 post scaler */
#define HRTIM_ADCPS1_ADC4PSC_MASK      (0x1f << HRTIM_ADCPS1_ADC4PSC_SHIFT)
#define HRTIM_ADCPS1_ADC5PSC_SHIFT     24                                /* Bits 24-28: ADC 5 post scaler */
#define HRTIM_ADCPS1_ADC5PSC_MASK      (0x1f << HRTIM_ADCPS1_ADC5PSC_SHIFT)

/* Common ADC post scaler register 2 */

#define HRTIM_ADCPS2_ADC6PSC_SHIFT     0                                 /* Bits 0-4: ADC 6 post scaler */
#define HRTIM_ADCPS2_ADC6PSC_MASK      (0x1f << HRTIM_ADCPS2_ADC6PSC_SHIFT)
#define HRTIM_ADCPS2_ADC7PSC_SHIFT     6                                 /* Bits 6-10: ADC 7 post scaler */
#define HRTIM_ADCPS2_ADC7PSC_MASK      (0x1f << HRTIM_ADCPS2_ADC7PSC_SHIFT)
#define HRTIM_ADCPS2_ADC8PSC_SHIFT     12                                /* Bits 12-16: ADC 8 post scaler */
#define HRTIM_ADCPS2_ADC8PSC_MASK      (0x1f << HRTIM_ADCPS2_ADC8PSC_SHIFT)
#define HRTIM_ADCPS2_ADC9PSC_SHIFT     18                                /* Bits 18-22: ADC 9 post scaler */
#define HRTIM_ADCPS2_ADC9PSC_MASK      (0x1f << HRTIM_ADCPS2_ADC9PSC_SHIFT)
#define HRTIM_ADCPS2_ADC10PSC_SHIFT    24                                /* Bits :24-28 ADC 10 post scaler */
#define HRTIM_ADCPS2_ADC10PSC_MASK     (0x1f << HRTIM_ADCPS2_ADC10PSC_SHIFT)

/* Common HRTIM fault input register 3 */

#define HRTIM_FLTINR3_FLT1BLKE         (1 << 0)                          /* Bit 0: Fault 1 blanking enable */
#define HRTIM_FLTINR3_FLT1BLKS         (1 << 1)                          /* Bit 1: Fault 1 blanking source */
#define HRTIM_FLTINR3_FLT1CNT_SHIFT    2                                 /* Bits 2-5: Fault 1 counter */
#define HRTIM_FLTINR3_FLT1CNT_MASK     (0xf << HRTIM_FLTINR3_FLT1CNT_SHIFT)
#define HRTIM_FLTINR3_FLT1CRES         (1 << 6)                          /* Bit 6: Fault 1 counter reset */
#define HRTIM_FLTINR3_FLT1RSTM         (1 << 7)                          /* Bit 7: Fault 1 reset mode */
#define HRTIM_FLTINR3_FLT2BLKE         (1 << 8)                          /* Bit 8: Fault 2 blanking enable */
#define HRTIM_FLTINR3_FLT2BLKS         (1 << 9)                          /* Bit 9: Fault 2 blanking source */
#define HRTIM_FLTINR3_FLT2CNT_SHIFT    10                                /* Bits 10-13: Fault 2 counter */
#define HRTIM_FLTINR3_FLT2CNT_MASK     (0xf << HRTIM_FLTINR3_FLT2CNT_SHIFT)
#define HRTIM_FLTINR3_FLT2CRES         (1 << 14)                         /* Bit 14: Fault 2 counter reset */
#define HRTIM_FLTINR3_FLT2RSTM         (1 << 15)                         /* Bit 15: Fault 2 reset mode */
#define HRTIM_FLTINR3_FLT3BLKE         (1 << 16)                         /* Bit 16: Fault 3 blanking enable */
#define HRTIM_FLTINR3_FLT3BLKS         (1 << 17)                         /* Bit 17: Fault 3 blanking source */
#define HRTIM_FLTINR3_FLT3CNT_SHIFT    18                                /* Bits 18-21: Fault 3 counter */
#define HRTIM_FLTINR3_FLT3CNT_MASK     (0xf << HRTIM_FLTINR3_FLT3CNT_SHIFT)
#define HRTIM_FLTINR3_FLT3CRES         (1 << 22)                         /* Bit 22: Fault 3 counter reset */
#define HRTIM_FLTINR3_FLT3RSTM         (1 << 23)                         /* Bit 23: Fault 3 reset mode */
#define HRTIM_FLTINR3_FLT4BLKE         (1 << 24)                         /* Bit 24: Fault 4 blanking enable */
#define HRTIM_FLTINR3_FLT4BLKS         (1 << 25)                         /* Bit 25: Fault 4 blanking source */
#define HRTIM_FLTINR3_FLT4CNT_SHIFT    26                                /* Bits 26-29: Fault 4 counter */
#define HRTIM_FLTINR3_FLT4CNT_MASK     (0xf << HRTIM_FLTINR3_FLT4CNT_SHIFT)
#define HRTIM_FLTINR3_FLT4CRES         (1 << 30)                         /* Bit 30: Fault 4 counter reset */
#define HRTIM_FLTINR3_FLT4RSTM         (1 << 31)                         /* Bit 31: Fault 4 reset mode */

/* Common HRTIM fault input register 4 */

#define HRTIM_FLTINR3_FLT5BLKE         (1 << 0)                          /* Bit 0: Fault 5 blanking enable */
#define HRTIM_FLTINR3_FLT5BLKS         (1 << 1)                          /* Bit 1: Fault 5 blanking source */
#define HRTIM_FLTINR3_FLT5CNT_SHIFT    2                                 /* Bits 2-5: Fault 5 counter */
#define HRTIM_FLTINR3_FLT5CNT_MASK     (0xf << HRTIM_FLTINR3_FLT5CNT_SHIFT)
#define HRTIM_FLTINR3_FLT5CRES         (1 << 6)                          /* Bit 6: Fault 5 counter reset */
#define HRTIM_FLTINR3_FLT5RSTM         (1 << 7)                          /* Bit 7: Fault 5 reset mode */
#define HRTIM_FLTINR3_FLT6BLKE         (1 << 8)                          /* Bit 8: Fault 6 blanking enable */
#define HRTIM_FLTINR3_FLT6BLKS         (1 << 9)                          /* Bit 9: Fault 6 blanking source */
#define HRTIM_FLTINR3_FLT6CNT_SHIFT    10                                /* Bits 10-13: Fault 6 counter */
#define HRTIM_FLTINR3_FLT6CNT_MASK     (0xf << HRTIM_FLTINR3_FLT6CNT_SHIFT)
#define HRTIM_FLTINR3_FLT6CRES         (1 << 14)                         /* Bit 14: Fault 6 counter reset */
#define HRTIM_FLTINR3_FLT6RSTM         (1 << 15)                         /* Bit 15: Fault 6 reset mode */

#endif /* __ARCH_ARM_SRC_STM32_HARDWARE_STM32G47XXX_HRTIM_H */
